&НаСервере
Функция ПолучитьПоляЗаполнения() Экспорт
	
	МассивПолейЗаполнения = Новый Массив;
	
	//ЖИВОТНОЕ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Животное");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Животное   ");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Животные"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//УДОЙ УТРО
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"УдойУтро");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Удой (утро)        ");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//УДОЙ ДЕНЬ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"УдойОбед");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Удой (обед)        ");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//УДОЙ ДЕНЬ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"УдойВечер");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Удой (вечер)        ");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);

    //УДОЙ ДЕНЬ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"УдойСуточный");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Удой (суточный)        ");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	Возврат МассивПолейЗаполнения;
	
КонецФункции









































