&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Объект.ПрефиксНомераЖивотного = 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
           	|	Фермы.ПрефиксНомераЖивотного КАК Префикс
           	|ИЗ
           	|	Справочник.Фермы КАК Фермы
           	|
           	|УПОРЯДОЧИТЬ ПО
           	|	Фермы.ПрефиксНомераЖивотного УБЫВ";
			
			Ответ = Запрос.Выполнить().Выгрузить();
			Объект.ПрефиксНомераЖивотного = ?(Ответ.Количество(), Ответ[0].Префикс + 1, 1);
			
		КонецЕсли;
		
		Если НЕ Объект.ДнейСтельностиТелки Тогда
			Объект.ДнейСтельностиТелки  = 284;
		КонецЕсли;
		
		Если НЕ Объект.ДнейСтельностиКоровы Тогда
			Объект.ДнейСтельностиКоровы = 284;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	АвтонумерацияЖивотногоПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтонумерацияЖивотногоПриИзменении(Элемент)
	
	Элементы.ПрефиксНомераЖивотного.Видимость 	= Объект.АвтонумерацияЖивотного;
	Элементы.ДлинаКодаЖивотного.Видимость 		= Объект.АвтонумерацияЖивотного;
	
КонецПроцедуры
