
Функция ДанныеПоследнегоОсеменения(Дата,Животное) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ОсемененияСрезПоследних.Период) КАК Период
	               |ПОМЕСТИТЬ втПоследнийРегистратор
	               |ИЗ
	               |	РегистрСведений.Осеменения.СрезПоследних(&Дата, Животное = &Животное) КАК ОсемененияСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОсемененияСрезПоследних.Осеменатор КАК Осеменатор,
	               |	ОсемененияСрезПоследних.Семя КАК Семя,
	               |	ОсемененияСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	втПоследнийРегистратор КАК втПоследнийРегистратор
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Осеменения.СрезПоследних(&Дата, Животное = &Животное) КАК ОсемененияСрезПоследних
	               |		ПО втПоследнийРегистратор.Период = ОсемененияСрезПоследних.Период";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Животное", Животное); 
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураВозврат = Неопределено;	
	Если Выборка.Следующий() Тогда
		СтруктураВозврат = Новый Структура("Осеменатор,Семя,Регистратор");
		ЗаполнитьЗначенияСвойств(СтруктураВозврат,Выборка);
	КонецЕсли;
    Возврат СтруктураВозврат;
	
КонецФункции
