
&НаКлиенте
Процедура ПрепаратыПрепаратПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Препараты.ТекущиеДанные;
	
	ТекущиеДанные.ЕдиницаИзмерения = ОбщегоНазначения.ПолучитьСвойствоОбъекта(ТекущиеДанные.Препарат, "ЕдиницаИзмерения");
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиСхемуЛечения(Команда)
	
	ПечатнаяФорма = СформироватьПечатнуюФорму();
	ПечатнаяФорма.Показать();
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФорму()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	Макет = СправочникОбъект.ПолучитьМакет("СхемаЛечения");
	
	ОбластьШапка 					= Макет.ПолучитьОбласть("Шапка|ОбластьКолонок");
	ОбластьСтрока 				= Макет.ПолучитьОбласть("СтрокаИспользуемогоПрепарата|ОбластьКолонок");
	ОбластьШапкаОписания 	= Макет.ПолучитьОбласть("ШапкаОписания|ОбластьКолонок");
	ОбластьОписание				= Макет.ПолучитьОбласть("Описание|ОбластьКолонок");
	
	ОбластьШапка.Параметры.НазваниеСхемы 	= Объект.Наименование;
	ОбластьШапка.Параметры.Разработал			= Объект.Разработал;
	ОбластьШапка.Параметры.Дата					= Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.КоличествоДней 	= Объект.ПрименятьДней;	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Препараты Цикл
		
		ОбластьСтрока.Параметры.НомерСтроки 			= СтрокаТабличнойЧасти.НомерСтроки;
		ОбластьСтрока.Параметры.НазваниеПрепарата 	= СтрокаТабличнойЧасти.Препарат;
		ОбластьСтрока.Параметры.Количество 			= СтрокаТабличнойЧасти.Количество;
		ОбластьСтрока.Параметры.ЕдиницаИзмерения 	= СтрокаТабличнойЧасти.ЕдиницаИзмерения;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьШапкаОписания);
	
	ОбластьОписание.Параметры.Описание = Объект.ОписаниеСхемы;
	ТабличныйДокумент.Вывести(ОбластьОписание);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

