
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)  
	
    СтандартнаяОбработка = Ложь;
    Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ДокументРезультат.Рисунки.Количество() = 0 Тогда
		//Для Строка = 1 По 6 Цикл
		//	Для Колонка = 1 По ДокументРезультат.ШиринаТаблицы Цикл
		//		Ячейка = ДокументРезультат.Область(Строка,Колонка);
		//		Если Ячейка.Текст = "Производственная группа" Тогда
		//			Ячейка.Примечание.Текст = "Брак - коровы" + Символы.ПС + "Брак* - тёлки"; 
		//		КонецЕсли;
		//	КонецЦикла;	
		//КонецЦикла;
		
		ДокументРезультат.ФиксацияСлева = 4;   
		ДокументРезультат.ФиксацияСверху = 4; 
	КонецЕсли;  
	
КонецПроцедуры
