
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Взвешивания.Записывать 		= Истина;
	Движения.РазмещениеЖивотных.Записывать 	= Истина;
	
	Для каждого СтрокаТабличнойЧасти из Животные Цикл
		
		НовоеДвижение = Движения.Взвешивания.Добавить();
		
		НовоеДвижение.Период				= Дата;
		НовоеДвижение.Животное 				= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Вес					= СтрокаТабличнойЧасти.Вес;
		НовоеДвижение.Рост					= СтрокаТабличнойЧасти.Рост;
		НовоеДвижение.ВесТриМесяца			= СтрокаТабличнойЧасти.ВесТриМесяца;
		НовоеДвижение.СреднеСуточныйПривес	= СтрокаТабличнойЧасти.Привес;
		НовоеДвижение.Примечание			= "Отъем теленка " + СтрокаТабличнойЧасти.Примечание;
		
		Если ЗначениеЗаполнено(КорпусПеремещения) Тогда
			НовоеДвижение 					= Движения.РазмещениеЖивотных.Добавить();
			НовоеДвижение.Период 			= Дата;
			НовоеДвижение.Животное 			= СтрокаТабличнойЧасти.Животное;
			НовоеДвижение.Корпус 			= КорпусПеремещения;
			НовоеДвижение.Ферма 			= Ферма;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	НепроверяемыеРеквизиты = Новый Массив();
	
	Если Проведен Тогда  
		НепроверяемыеРеквизиты.Добавить("КорпусПеремещения");
	КонецЕсли;
  	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);	
	
КонецПроцедуры





































