
&НаКлиенте
Процедура Перепровести(Команда)
	ПерепровестиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерепровестиНаСервере()  
	
	Если СписокНоменклатуры.Количество() <> 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыНаСкладахОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Номенклатура В (&СписокНоменклатуры)) КАК ТоварыНаСкладахОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры.ВыгрузитьЗначения());  
		Запрос.УстановитьПараметр("ДатаНачала", Дата);  
		Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата());  
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			Сообщить("Документы не найдены");	
		КонецЕсли;
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.Регистратор.ПолучитьОбъект();	
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
		КонецЦикла; 
		Сообщить("Перепроведение завершено");	
	КонецЕсли;  
	
КонецПроцедуры
