
#Область ОбработкаТЧ

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмерения");
		СтруктураДействий.Вставить("ПересчитатьСумму");

		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);	
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;

	СтруктураДействий = Новый Структура;	
	СтруктураДействий.Вставить("ПересчитатьСумму");    
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;  
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуПоСумме");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры   

#КонецОбласти
