
&НаКлиенте
Процедура ПереместитьВверх(Команда) 
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ПереместитьНаСервере(ТекущиеДанные.Ссылка, "Вверх");
	Элементы.Список.Обновить();
	
КонецПроцедуры   

&НаКлиенте
Процедура ПереместитьВниз(Команда)  
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ПереместитьНаСервере(ТекущиеДанные.Ссылка, "Вниз"); 
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереместитьНаСервере(Показатель, Направление) 
	
	ТекущийКод = Показатель.Код;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоказателиРационов.Ссылка КАК Ссылка,
	|	ПоказателиРационов.Код КАК Код
	|ИЗ
	|	Справочник.ПоказателиРационов КАК ПоказателиРационов
	|ГДЕ
	|	ПоказателиРационов.Код < &Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ"; 
	Если Направление = "Вниз" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "<", ">");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, " УБЫВ", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("Код", ТекущийКод); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		НачатьТранзакцию(); 
		
		ПоказательВыборкиОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПоказательВыборкиОбъект.УстановитьНовыйКод(); 
		ПоказательВыборкиОбъект.Записать();
		
		ПоказательОбъект = Показатель.ПолучитьОбъект();
		ПоказательОбъект.Код = Выборка.Код; 
		ПоказательОбъект.Записать();   
		
		ПоказательВыборкиОбъект.Код = ТекущийКод;
		ПоказательВыборкиОбъект.Записать(); 
	
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
		
КонецПроцедуры

