
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		Объект.Дата		= ТекущаяДата();
		Объект.Автор	= ПараметрыСеанса.ТекущийПользователь;
		Объект.Ферма	= Объект.Автор.ОсновнаяФерма;
		Объект.Склад	= Объект.Автор.ОсновнойСклад;
	Иначе
		Белок	= Объект.ПроцентныйБелок;
		Жир 	= Объект.ПроцентныйЖир
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Ферма) Тогда
		Если Не ЗначениеЗаполнено(Объект.КоличествоДойныхКоров) Тогда
			СписокЖивотных = ДанныеЖивотных.КоличествоЖивотныхВДойныхКорпусах(Объект.Ферма, Объект.Дата);
			Объект.КоличествоДойныхКоров = СписокЖивотных.Количество();	
		КонецЕсли;  
		Если Не ЗначениеЗаполнено(Объект.КоличествоФуражныхКоров) Тогда
			Объект.КоличествоФуражныхКоров = ДанныеЖивотных.КоличествоФуражныхКоров(Объект.Ферма, Объект.Дата);
		КонецЕсли;  
	КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = ОграничениеДоступности.ОграничитьДанныеДокумента(Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ПроцентныйЖир 	= Число(?(ПустаяСтрока(Жир),0,Жир)); 
	Объект.ПроцентныйБелок 	= Число(?(ПустаяСтрока(Белок),0,Белок));
	
КонецПроцедуры

&НаКлиенте
Процедура ВаловыйНадойПриИзменении(Элемент)
	
	ПересчитатьДанныеМолока();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентныйЖирПриИзменении(Элемент)
	
	ПересчитатьДанныеМолока();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентныйБелокПриИзменении(Элемент)
	
	ПересчитатьДанныеМолока();
	
КонецПроцедуры

&НаКлиенте
Процедура МолокоНаВыпойкуПриИзменении(Элемент)
	
	ПересчитатьДанныеМолока();
	
КонецПроцедуры


//СЛУЖЕБНЫЕ
&НаСервере
Функция ПересчитатьДанныеМолока()
	
	Объект.ЖирМолока 					= Объект.ВаловыйНадой * Число(?(ПустаяСтрока(Жир),0,Жир)) / 100;
	Объект.БелокМолока 					= Объект.ВаловыйНадой * Число(?(ПустаяСтрока(Белок),0,Белок)) / 100;
	Объект.СреднесуточныйУдой 			= Объект.ВаловыйНадой / Макс(Объект.КоличествоДойныхКоров, 1);
	Объект.ТоварностьМолока 			= 100 - Объект.МолокоНаВыпойку / Макс(Объект.ВаловыйНадой, 1) * 100;
	Объект.СреднесуточныйУдойФуражный 	= Объект.ВаловыйНадой / Макс(Объект.КоличествоФуражныхКоров, 1);
	
КонецФункции

&НаКлиенте
Процедура ФермаПриИзменении(Элемент)
	
	Объект.КоличествоФуражныхКоров = ДанныеЖивотных.КоличествоФуражныхКоров(Объект.Ферма, Объект.Дата);

	СписокЖивотных = ДанныеЖивотных.КоличествоЖивотныхВДойныхКорпусах(Объект.Ферма, Объект.Дата);
	Объект.КоличествоДойныхКоров = СписокЖивотных.Количество();
	
	ПересчитатьДанныеМолока();
	
КонецПроцедуры



