Процедура УстановкаПараметровСеанса (ТребуемыеПараметры)
	
	//ИЩЕМ СОТРУДНИКА ПО ИМЕНИ ПОЛЬЗОВАТЕЛЯ
	ИмяПользователя = ИмяПользователя();
	Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
		
		ИмяПользователя = "Администратор";
		
	КонецЕсли;
	
	НайденныйПользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);	
	
	//ЕСЛИ ПОЛЬЗОВАТЕЛЯ НЕТ, СОЗДАЕМ
	Если НайденныйПользователь.Пустая() Тогда
		НайденныйПользователь 				= Справочники.Пользователи.СоздатьЭлемент();
		НайденныйПользователь.Наименование 	= ИмяПользователя;
		НайденныйПользователь.Записать();
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = НайденныйПользователь.Ссылка;
	
КонецПроцедуры