
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	КомпоновщикНастроекФормы = ЭтаФорма.Отчет.КомпоновщикНастроек;  
	НастройкиОтчета = КомпоновщикНастроекФормы.Настройки; 
	
	Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("ДоступКоВсемФермам") Тогда
		ПолеСКДФерма = Новый ПолеКомпоновкиДанных("Ферма");
		ЭлементФерма = ВернутьЭлементОтбора(ПолеСКДФерма,НастройкиОтчета);
		Если ЭлементФерма = Неопределено Тогда
			ЭлементФерма = НастройкиОтчета.Структура[0].Строки[0].Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
			ЭлементФерма.ЛевоеЗначение = ПолеСКДФерма;
		КонецЕсли; 
		ЭлементФерма.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь.ОсновнаяФерма;  
		ЭлементФерма.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементФерма.Использование = Истина;
		ЭлементФерма.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементФерма = ВернутьЭлементОтбора(ПолеСКДФерма, КомпоновщикНастроекФормы.Настройки);
		Если ЭлементФерма <> Неопределено Тогда
		    Настройки = КомпоновщикНастроекФормы.Настройки;
			Настройки.Отбор.Элементы.Удалить(ЭлементФерма); 
			КомпоновщикНастроекФормы.ЗагрузитьНастройки(Настройки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	ПриОткрытииНаСервере();  
КонецПроцедуры  

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	ПриОткрытииНаСервере();
КонецПроцедуры

Функция ВернутьЭлементОтбора(ПолеСКД, НастройкиОтчета, ВидСравненияПоля = Неопределено)

	НайденныйЭлемент = Неопределено;
	Для каждого Элемент Из НастройкиОтчета.Структура[0].Строки[0].Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеСКД И (ВидСравненияПоля = Неопределено ИЛИ Элемент.ВидСравнения = ВидСравненияПоля) Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденныйЭлемент;

КонецФункции 

&НаСервере
Процедура ИзменитьОтборНаСервере(ИмяОтбора,ВидСравненияПоля,Значение,Использование)

	КомпоновщикНастроекФормы 	= Отчет.КомпоновщикНастроек;  
	НастройкиОтчета				= КомпоновщикНастроекФормы.Настройки;  
	ПолеСКД 					= Новый ПолеКомпоновкиДанных(ИмяОтбора);
	ЭлементСКД 					= ВернутьЭлементОтбора(ПолеСКД,НастройкиОтчета,ВидСравненияПоля);  
	ЭлементСКД.ПравоеЗначение 	= Значение; 
	ЭлементСКД.Использование	= Использование; 

КонецПроцедуры






