Функция РассчитатьКоличествоВОсновнойЕдиницеИзмерения(Номенклатура, ЕдиницаИзмерения, Количество, ОтображатьОшибки = Ложь) Экспорт
	
	Если ТипЗнч(Номенклатура) <> Тип("СправочникСсылка.Номенклатура")
				ИЛИ ТипЗнч(ЕдиницаИзмерения) <> Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				
				Если ОтображатьОшибки Тогда
					Сообщить("Для номенклатуры " + Номенклатура + " не указан коэффициент единицы измерения " + ЕдиницаИзмерения + ". Пересчет будет проходить по форме 1:1");
				КонецЕсли;
				Возврат Количество;
	КонецЕсли;
	
	СтрокаЕдиницы = Номенклатура.ЕдиницыИзмерения.Найти(ЕдиницаИзмерения);
	
	Если СтрокаЕдиницы = Неопределено Тогда
		
		Если ОтображатьОшибки Тогда
					Сообщить("Для номенклатуры " + Номенклатура + " не указан коэффициент единицы измерения " + ЕдиницаИзмерения + ". Пересчет будет проходить по форме 1:1");
		КонецЕсли;
		Возврат Количество;
	КонецЕсли;
	
	Возврат СтрокаЕдиницы.Коэффициент * Количество; 
	
КонецФункции

Функция РассчитатьКоличествоВОсновнойЕдиницеИзмеренияВТабличнойЧасти(Таблица) Экспорт
	
	Если Таблица.Количество() > 0 Тогда
	
		УникальныйИдентификаторПроверки = Новый УникальныйИдентификатор;
		СтруктураПроверки = Новый Структура("Номенклатура", УникальныйИдентификаторПроверки); 
		
		ЗаполнитьЗначенияСвойств(СтруктураПроверки, Таблица.Получить(0));
		НазваниеКолонкиНоменклатура = СтруктураПроверки.Номенклатура <> УникальныйИдентификаторПроверки;
		
		Для каждого СтрокаТабличнойЧасти Из Таблица Цикл
			СтрокаТабличнойЧасти.Количество = РассчитатьКоличествоВОсновнойЕдиницеИзмерения(?(НазваниеКолонкиНоменклатура, СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Препарат), СтрокаТабличнойЧасти.ЕдиницаИзмерения, СтрокаТабличнойЧасти.Количество, Истина);
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

Функция РассчитатьКоличествоИзОсновнойЕдиницыИзмерения(Номенклатура, ЕдиницаИзмерения, Количество) Экспорт
	
	Если ТипЗнч(Номенклатура) <> Тип("СправочникСсылка.Номенклатура")
				ИЛИ ТипЗнч(ЕдиницаИзмерения) <> Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				
				Возврат Количество;
	КонецЕсли;
	
	СтрокаЕдиницы = Номенклатура.ЕдиницыИзмерения.Найти(ЕдиницаИзмерения);
	
	Если СтрокаЕдиницы = Неопределено Тогда
		Возврат Количество;
	КонецЕсли;
	
	Возврат Количество / ?(СтрокаЕдиницы.Коэффициент = 0, 1, СтрокаЕдиницы.Коэффициент); 

	
КонецФункции
