
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Наименование = &Наименование
	               |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	               |	И Номенклатура.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
	    Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = СтрШаблон("Номенклатура с наименованием %1 уже существует в базе.", Наименование);
		Сообщение.Поле = "Объект.Наименование";
		Сообщение.УстановитьДанные(Выборка.Номенклатура);
	    Сообщение.Сообщить();
	    Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры
