&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТолькоПросмотр = ОграничениеДоступности.ОграничитьДанныеДокумента(Объект.Дата);
	УстановитьВидимость();

КонецПроцедуры   

//СОБЫТИЯ РЕКВИЗИТОВ ШАПКИ   

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент) 
	
	ЦенаВключаетНДСПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСПриИзменении(Элемент)
	
	УчитыватьНДСПриИзмененииСервер();
	УстановитьВидимость();
	
КонецПроцедуры 

&НаСервере
Процедура УчитыватьНДСПриИзмененииСервер()
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;  
	Если Объект.УчитыватьНДС Тогда
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС"); 
	КонецЕсли;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы); 
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Продукция, СтруктураДействий);
	
КонецПроцедуры 

&НаСервере
Процедура ЦенаВключаетНДСПриИзмененииСервер()
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы); 
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Продукция, СтруктураДействий);
	
КонецПроцедуры 

//СОБЫТИЯ ТАБЛИЧНЫХ ЧАСТЕЙ  
#Область ОбработкаТЧ

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС, Дата, Склад", 
												   Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС, Объект.Дата, Объект.Склад);
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмерения");
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС");
		СтруктураДействий.Вставить("ЗаполнитьСреднююЦену", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");

		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");    
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;  
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные; 
	
	Если ТекущаяСтрока <> Неопределено Тогда
		СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС, Дата, Склад", 
												   Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС, Объект.Дата, Объект.Склад);
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьСреднююЦену",СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");

		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);	
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуПоСумме");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры   

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);   
	
КонецПроцедуры   

&НаКлиенте
Процедура ТоварыСуммаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры 

#КонецОбласти

&НаКлиенте
Процедура УстановитьВидимость()
	
	ВестиУчетНДС = Объект.УчитыватьНДС; 
	Элементы.ТоварыСтавкаНДС.Видимость	= ВестиУчетНДС;
	Элементы.ТоварыСуммаНДС.Видимость	= ВестиУчетНДС; 
	Элементы.ТоварыСуммаСНДС.Видимость	= ВестиУчетНДС;

КонецПроцедуры // УстановитьВидимость()







