
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СформироватьДеревоСвязей();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Предопределенный
					И Объект.НеРаботает Тогда
					
					ОписаниеОповещения = Новый ОписаниеОповещения("ПустоеОповещение", ОбщегоНазначения);
					ПоказатьПредупреждение(ОписаниеОповещения, "Неопределенного быка нельзя сделать архивным");
					
					Отказ = Истина;
					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда 
		ЗаполнитьДанныеОСемени();
		
		ЗаполнитьДанныеОбИндексах();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСемениПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ФормаСправочника = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента");
	ДанныеФормы 	 = ФормаСправочника.Объект;
	
	СозданиеНовогоТипаСемени(ДанныеФормы);
	
	КопироватьДанныеФормы(ДанныеФормы, ФормаСправочника.Объект);
	
	ФормаСправочника.Открыть();
	
КонецПроцедуры

&НаСервере
Функция СозданиеНовогоТипаСемени(ДанныеФормы)
	
	СправочникОбъект = ДанныеФормыВЗначение(ДанныеФормы, Тип("СправочникОбъект.Номенклатура"));
	СправочникОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	СправочникОбъект.Бык = Объект.Ссылка;
	//СправочникОбъект.Семя = Истина;  
	СправочникОбъект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Семя");
	ЗначениеВДанныеФормы(СправочникОбъект, ДанныеФормы);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокПартийСемениВБыках" Тогда
			
		ЗаполнитьДанныеОСемени();		
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КличкаПриИзменении(Элемент)
	
	НаименованиеБыкаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеБыка(Элемент)
	
	НаименованиеБыкаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаименованиеБыкаНаСервере()
	
	Объект.Наименование = Объект.Кличка + " " + Объект.КодСемени;
	
КонецПроцедуры

&НаКлиенте
Процедура КодСемениПриИзменении(Элемент)
	
	НаименованиеБыкаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРодственныхСвязейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ДеревоРодственныхСвязей.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Предок) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Предок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодословнаяПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Родословная) Тогда
		СформироватьДеревоСвязей();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИндексов(Команда)
	
	ФормаИндексов = ПолучитьФорму("РегистрСведений.ИндексыБыков.Форма.ФормаСписка");
	
	 ЭлементОтбора = ФормаИндексов.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	 ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Бык");
	 ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	 ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
     ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	 
	 ФормаИндексов.Открыть();
	 
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеОСемени()
	
	СписокСемени.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Семя
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Бык = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	СписокСемени.Загрузить(РезультатЗапроса.Скопировать());
	
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеОбИндексах()
	
	ИндексыБыков = ДанныеЖивотных.ПолучитьИндексыБыка(Объект.Ссылка);
	
	TPI 	= ИндексыБыков.TPI;
	NM 		= ИндексыБыков.NM;
	Молоко 	= ИндексыБыков.Молоко;
	CCR 	= ИндексыБыков.CCR;
	PL 		= ИндексыБыков.PL;
	HCR 	= ИндексыБыков.HCR;
	
КонецФункции

&НаСервере
Процедура СформироватьДеревоСвязей()

	ДеревоСвязей = РегистрыСведений.РодственныеСвязи.СформироватьДеревоСвязей(Объект.Родословная);
	ЗначениеВДанныеФормы(ДеревоСвязей, ДеревоРодственныхСвязей);

КонецПроцедуры

















