	
#Область ОбработчикиСобытийФормы   
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТолькоПросмотр = ОграничениеДоступности.ОграничитьДанныеДокумента(Объект.Дата);
	УстановитьВидимость();
	
КонецПроцедуры   

#КонецОбласти  

#Область СобытияРеквизитовШапки

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент) 
	
	ЦенаВключаетНДСПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСПриИзменении(Элемент)
	
	УчитыватьНДСПриИзмененииСервер();
	УстановитьВидимость();
	
КонецПроцедуры 

&НаСервере
Процедура УчитыватьНДСПриИзмененииСервер()
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;  
	Если Объект.УчитыватьНДС Тогда
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС"); 
	КонецЕсли;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы); 
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Продукция, СтруктураДействий);
	
КонецПроцедуры 

&НаСервере
Процедура ЦенаВключаетНДСПриИзмененииСервер()
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы); 
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Продукция, СтруктураДействий);
	
КонецПроцедуры 

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере() 
	
	ПерезаполнитьЦеныНаСервере();
	Элементы.ПродукцияПерезаполнитьЦены.Видимость = ЗначениеЗаполнено(Объект.ДоговорКонтрагента);
	
КонецПроцедуры 

#КонецОбласти  

#Область ОбработкаТЧ

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьЕдиницуИзмерения");   
		Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			СтруктураПересчетаСуммы.Вставить("Договор", Объект.ДоговорКонтрагента);
			СтруктураДействий.Вставить("ЗаполнитьЦенуПоДоговору", СтруктураПересчетаСуммы);
		КонецЕсли; 
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС"); 
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");

		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);	
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;

	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");    
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;  
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПродукцияСуммаПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуПоСумме");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры   

&НаКлиенте
Процедура ПродукцияСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);   
	
КонецПроцедуры   

&НаКлиенте
Процедура ПродукцияСуммаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы[ЭтаФорма.ТекущийЭлемент.Имя].ТекущиеДанные;
	
	СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС", Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВопросаЗапись", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Документ должен быть записан перед заполнением. Записать?", РежимДиалогаВопрос.ДаНет);
		Возврат;	
	КонецЕсли;
	
	РазделУчета = Элементы.СтраницыТабличныхЧастей.ТекущаяСтраница.Имя;
	
	ВзаимодействиеКлиент.ОткрытьФормуЗаполненияОбъектаНаОснованииФайла(ЭтаФорма, Объект.Ссылка, РазделУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	ПерезаполнитьЦеныНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ПерезаполнитьЦеныНаСервере() 
	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
	
		СтруктураПересчетаСуммы = Новый Структура("УчитыватьНДС, ЦенаВключаетНДС, Договор", 
												   Объект.УчитыватьНДС, Объект.ЦенаВключаетНДС, Объект.ДоговорКонтрагента);
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьЦенуПоДоговору", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");

		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Продукция, СтруктураДействий);
	
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти  

//Служебные процедуры и функции

&НаКлиенте
Функция ЗавершениеВопросаЗапись(ОтветПользователя, Параметры) Экспорт
	
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		Возврат 0;
	КонецЕсли;
	
	//ПОПРОБУЕМ ЗАПИСАТЬ
	
	Попытка 
		
		ЭтотОбъект.Записать();
		
		РазделУчета = Элементы.СтраницыТабличныхЧастей.ТекущаяСтраница.Имя;
		ВзаимодействиеКлиент.ОткрытьФормуЗаполненияОбъектаНаОснованииФайла(ЭтаФорма, Объект.Ссылка, РазделУчета);
		
	Исключение
		
		ВызватьИсключение "Ошибка при попытке записи";
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаполнениеДанныхИзФайлаПоступлениеТоваровУслуг" 
						И Источник = ОбщегоНазначения.ТекущийПользователь() Тогда
						
						ЗаполнитьНаОснованииФайлаНаСервере(Параметр);
						
				КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНаОснованииФайлаНаСервере(Параметр)
	
	Для каждого СтрокаТабличнойЧасти Из Параметр Цикл
		
		НоваяСтрока = Объект.Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		НоваяСтрока.Номенклатура = СтрокаТабличнойЧасти.НоменклатураУслуга;

		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		
		Если НоваяСтрока.Номенклатура.Услуга = Ложь Тогда
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()
	
	ВестиУчетНДС = Объект.УчитыватьНДС; 
	Элементы.ПродукцияСтавкаНДС.Видимость			= ВестиУчетНДС;
	Элементы.ПродукцияСуммаНДС.Видимость			= ВестиУчетНДС; 
	Элементы.ПродукцияСуммаСНДС.Видимость			= ВестиУчетНДС; 
	Элементы.ПродукцияПерезаполнитьЦены.Видимость 	= ЗначениеЗаполнено(Объект.ДоговорКонтрагента);

КонецПроцедуры // УстановитьВидимость()

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	ДоговорКонтрагентаПриИзмененииНаСервере();
КонецПроцедуры





