&НаСервере
Функция ОграничитьДанныеДокумента(ДатаДокумента) Экспорт

	Если РольДоступна("ПолныеПрава") И Не Константы.ОграничиватьПолныеПрава.Получить() Тогда
		Возврат Ложь;          
	КонецЕсли;
	
	Если ДатаДокумента < Константы.ДатаЗакрытияПериода.Получить() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПриЗаписиДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт  
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НачалоДня(Источник.Дата) > НачалоДня(ТекущаяДата()) Тогда
		Отказ = Истина;
		Сообщить("Дата документа не может быть больше текущей даты");
		Возврат;
	КонецЕсли;
	
	Отказ = ОграничитьДанныеДокумента(Источник.Дата);	
	Если Отказ Тогда
		Сообщить("Период закрыт, редактирование данных невозможно. Обратитесь к Администратору");
	КонецЕсли;
	
КонецПроцедуры
