
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь 		= ПараметрыСеанса.ТекущийПользователь;
	ФермаТекущегоПользователя 	= ТекущийПользователь.ОсновнаяФерма;
	
	Если ЗначениеЗаполнено(ФермаТекущегоПользователя) Тогда
		
		Отбор 					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение 	= ФермаТекущегоПользователя;
		Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Владелец");
		Отбор.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Отбор.Использование 	= Истина;
		
	КонецЕсли;
	
КонецПроцедуры
