&НаСервере
Функция ПолучитьПоляЗаполнения() Экспорт
	
	МассивПолейЗаполнения = Новый Массив;
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Пол");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Пол (NPOL)");
	//СтруктураДанных.Вставить("Тип", 					Тип("ПеречислениеСсылка.ПолЖивотного"));
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"РядРодословной");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Ряд родословной (NN)");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"ИдентификационныйНомер");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Идентификационный номер (NANIMAL)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Кличка");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Кличка (KLICHKA)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Порода");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Порода (NPOR)");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Породы"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Линия");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Линия (NLIN)");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Линии"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Породность");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Породность (NPORDN)");
	//СтруктураДанных.Вставить("Тип", 					Тип("Булево"));
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КомплексныйКласс");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Комплексный класс (NKKLASS)");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.КомплексныеКлассы"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"СтранаПроисхождения");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Страна происхождения (NGOS_EXPORT)");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.СтраныМира"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"ДатаРождения");
	СтруктураДанных.Вставить("ИмяКолонки", 				"дата рождения (DATE_ROGD)");
	СтруктураДанных.Вставить("Тип", 					Тип("Дата"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"НомерОтца");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Номер отца (NOTCA)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"НомерМатери");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Номер матери (NMATERI)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"РегистрационныйНомер");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Регистрационный номер (NIDENT_OLD)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Масть");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Масть (NMAST)");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Масти"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КодСемени");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Код семени (OSEMKOD)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КаппаКазеин");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Каппа-казеин (DNKVALUE1)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"БетаКазеин");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Бета-казеин (DNKVALUE4)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КличкаНаАнглийском");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Кличка на английском (ENGNAME)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	Возврат МассивПолейЗаполнения;
	
КонецФункции
