Функция ПолучитьПоляЗаполнения() Экспорт
	
	МассивПолейЗаполнения = Новый Массив;
	
	//НОМЕНКЛАТУРА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"НоменклатураУслуга");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОбщаяТаблица");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Номенклатура/Услуга");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Номенклатура"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//КОЛИЧЕСТВО
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Количество");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОбщаяТаблица");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Количество");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ЦЕНА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Цена");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОбщаяТаблица");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Цена");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	Возврат МассивПолейЗаполнения;
	
КонецФункции
