Функция ПолучитьПоляЗаполнения() Экспорт
	
	МассивПолейЗаполнения = Новый Массив;
	
	//ЖИВОТНОЕ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Животное");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Животное   ");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Животные"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ВЕС
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Вес");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Вес        ");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//РОСТ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Рост");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Рост        ");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	Возврат МассивПолейЗаполнения;
	
КонецФункции

