Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Взвешивания.Записывать = Истина;
	
	Для каждого СтрокаТабличнойЧасти Из Животные Цикл
		
		НовоеДвижение 						= Движения.Взвешивания.Добавить();
		НовоеДвижение.Вес	 				= СтрокаТабличнойЧасти.Вес;
		НовоеДвижение.Животное 				= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Период 				= Дата;
		НовоеДвижение.Примечание			= СтрокаТабличнойЧасти.Примечание;
		НовоеДвижение.Рост					= СтрокаТабличнойЧасти.Рост;
		НовоеДвижение.СреднеСуточныйПривес 	= СтрокаТабличнойЧасти.СреднеСуточныйПривес;
		
	КонецЦикла;
	
КонецПроцедуры







































