
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТаблицаПитательностиКормов.Записывать = Истина;
	Колонки = Новый Массив;
	Для каждого Колонка Из Метаданные().ТабличныеЧасти.Корма.Реквизиты Цикл
		Если Колонка.Имя = "Номенклатура" ИЛИ Колонка.Имя = "СухоеВещество" Тогда
			Продолжить; 
		Иначе
			Колонки.Добавить(Колонка.Имя);	
		КонецЕсли;
	КонецЦикла; 
	
	Для каждого СтрокаТЧ Из Корма Цикл 
		
		НовоеДвижение = Движения.ТаблицаПитательностиКормов.Добавить();
		НовоеДвижение.Период		= Дата;
		НовоеДвижение.Регистратор	= Ссылка;   
		НовоеДвижение.Номенклатура	= СтрокаТЧ.Номенклатура;
		НовоеДвижение.СухоеВещество = СтрокаТЧ.СухоеВещество; 
		
		//Коэффициент = СтрокаТЧ.СухоеВещество / 1000;	
		
		Для каждого Колонка Из Колонки Цикл 
			//Если Колонка = "РастворимыйСП" Тогда
			//	НовоеДвижение[Колонка] = СтрокаТЧ["XP"] * СтрокаТЧ[Колонка] / 100 * Коэффициент;			
			//Иначе	
			//	НовоеДвижение[Колонка] = СтрокаТЧ[Колонка] * Коэффициент;			
			//КонецЕсли; 
			НовоеДвижение[Колонка] = СтрокаТЧ[Колонка]
		КонецЦикла;
		
	КонецЦикла;  
	
КонецПроцедуры
