&НаСервере
Функция ПолучитьПоляЗаполнения() Экспорт
	
	РеквизитыТЧ = Метаданные.Документы.ИндексыБыков.ТабличныеЧасти.ОсновныеИндексы.Реквизиты;
	МассивПолейЗаполнения = Новый Массив;  
	
	Для каждого Реквизит Из РеквизитыТЧ Цикл 
		
		ТипПоля = Тип("Строка");
		ОбязательноеПоле = Ложь;
		ИмяКолонки = Реквизит.Синоним;
		Если Реквизит.Имя = "Бык" Тогда
			ОбязательноеПоле = Истина;
			ИмяКолонки = "Код семени";
		КонецЕсли;
	
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Имя", 					Реквизит.Имя);
		СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
		СтруктураДанных.Вставить("ИмяКолонки", 				Лев(ИмяКолонки + "               ",15));
		СтруктураДанных.Вставить("Тип", 					Реквизит.Тип.Типы()[0]);
		СтруктураДанных.Вставить("ОбязательноеПоле", 		ОбязательноеПоле);
		МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	КонецЦикла;
	
	////БЫК
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("Имя", 					"Бык");
	//СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	//СтруктураДанных.Вставить("ИмяКолонки", 				"Код быка       ");
	//СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.БыкиПлеменные"));
	//СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	//МассивПолейЗаполнения.Добавить(СтруктураДанных);
	//
	////TPI
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("Имя", 					"TPI");
	//СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	//СтруктураДанных.Вставить("ИмяКолонки", 				"TPI            ");
	//СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	//СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	//МассивПолейЗаполнения.Добавить(СтруктураДанных);
	//
	////NM
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("Имя", 					"NM");
	//СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	//СтруктураДанных.Вставить("ИмяКолонки", 				"NM				");
	//СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	//СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	//МассивПолейЗаполнения.Добавить(СтруктураДанных);    
	//
	////CM
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("Имя", 					"CM");
	//СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	//СтруктураДанных.Вставить("ИмяКолонки", 				"CM            ");
	//СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	//СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	//МассивПолейЗаполнения.Добавить(СтруктураДанных);
	//
	////FM
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("Имя", 					"FM");
	//СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	//СтруктураДанных.Вставить("ИмяКолонки", 				"FM            ");
	//СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	//СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	//МассивПолейЗаполнения.Добавить(СтруктураДанных);
	//
	////TPI
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("Имя", 					"GM");
	//СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	//СтруктураДанных.Вставить("ИмяКолонки", 				"GM            ");
	//СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	//СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	//МассивПолейЗаполнения.Добавить(СтруктураДанных);

	////Молоко
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("Имя", 					"Молоко");
	//СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	//СтруктураДанных.Вставить("ИмяКолонки", 				"Молоко		");
	//СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	//СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	//МассивПолейЗаполнения.Добавить(СтруктураДанных);

	////PL
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("Имя", 					"PL");
	//СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	//СтруктураДанных.Вставить("ИмяКолонки", 				"PL				");
	//СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	//СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	//МассивПолейЗаполнения.Добавить(СтруктураДанных);

	////CCR
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("Имя", 					"CCR");
	//СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	//СтруктураДанных.Вставить("ИмяКолонки", 				"CCR			");
	//СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	//СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	//МассивПолейЗаполнения.Добавить(СтруктураДанных);

	////HCR
	//СтруктураДанных = Новый Структура;
	//СтруктураДанных.Вставить("Имя", 					"HCR");
	//СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	//СтруктураДанных.Вставить("ИмяКолонки", 				"HCR			");
	//СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	//СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	//МассивПолейЗаполнения.Добавить(СтруктураДанных);

	Возврат МассивПолейЗаполнения;
	
КонецФункции
