
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьДанные();
		
КонецПроцедуры

&НаСервере
Функция ОбновитьДанные()
	
	ДатаОкончания 				= Период.ДатаОкончания;
	ВременнаяПеременная 	= Период.ДатаНачала;
	
	Данные.Очистить();
	
	Макет = ПолучитьОбщийМакет("МакетЗаполненияПроизводственнаяСводка");
	
	ОбластьПустота 	= Макет.ПолучитьОбласть("Пустота|Шапка");
	ОбластьДата		= Макет.ПолучитьОбласть("Шапка|Дата");
	ОбластьПустотаСтроки = Макет.ПолучитьОбласть("Пустота|Строки");
	ОбластьДатаСтроки 		= Макет.ПолучитьОбласть("Строки|Дата");
	
	//ВЫВОД ШАПКИ
	Данные.Вывести(ОбластьПустота);
	Пока НачалоДня(ВременнаяПеременная) <> НачалоДня(ДатаОкончания) Цикл
		
		ОбластьДата.Параметры.Дата = Формат(ВременнаяПеременная, "ДФ=dd.MM.yyyy");
		Данные.Присоединить(ОбластьДата);
		
		ВременнаяПеременная = ВременнаяПеременная + 86400;
		
	КонецЦикла;
	ОбластьДата.Параметры.Дата = Формат(ВременнаяПеременная, "ДФ=dd.MM.yyyy");
	Данные.Присоединить(ОбластьДата);
	
	//ВЫВОД ДАННЫХ СТРОК
	Данные.Вывести(ОбластьПустотаСтроки);
	
	ВременнаяПеременная = Период.ДатаНачала;
	Пока НачалоДня(ВременнаяПеременная) <> НачалоДня(ДатаОкончания) Цикл
		
		Данные.Присоединить(ОбластьДатаСтроки);
		
		ВременнаяПеременная = ВременнаяПеременная + 86400;
		
	КонецЦикла;
	Данные.Присоединить(ОбластьДатаСтроки);
	
КонецФункции

&НаКлиенте
Процедура Далее(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КонецВопроса", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, "Прочитать строки из табличного документа?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Функция КонецВопроса(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ПрочитатьДанныеФайла();
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПрочитатьДанныеФайла()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ПрочитанныеДанныеГруппа;
	
	КоличествоДней = ОбщегоНазначения.РазностьДат(Период.ДатаНачала, Период.ДатаОкончания, , Истина);
	
	Для НомерКолонки = 2 По КоличествоДней + 2 Цикл
		
		НоваяСтрокаДанных = ПрочитанныеДанные.Добавить();
		
		Попытка 
			
			ЗначениеЯчейки = Данные.Область(1, НомерКолонки, 1, НомерКолонки).Текст;
			СтрокаДаты = СокрЛП(ЗначениеЯчейки) + " 00:00:00";
			Попытка
				ПреобразованнаяДата = Дата(СтрокаДаты);
			Исключение 
				ПреобразованнаяДата = Дата(1, 1, 1);
			КонецПопытки;
			
			НоваяСтрокаДанных.Дата 	= ПреобразованнаяДата;
			НоваяСтрокаДанных.Надой 	= Число(Данные.Область(2, НомерКолонки, 2, НомерКолонки).Текст);
			НоваяСтрокаДанных.Выпойка = Число(Данные.Область(3, НомерКолонки, 3, НомерКолонки).Текст);
			НоваяСтрокаДанных.Ферма = Справочники.Фермы.НайтиПоНаименованию(Данные.Область(4, НомерКолонки, 4, НомерКолонки).Текст);
			НоваяСтрокаДанных.Склад = Справочники.Склад.НайтиПоНаименованию(Данные.Область(5, НомерКолонки, 5, НомерКолонки).Текст);
			НоваяСтрокаДанных.ДойныхГолов = Число(Данные.Область(6, НомерКолонки, 6, НомерКолонки).Текст);
			НоваяСтрокаДанных.Белок = Число(Данные.Область(7, НомерКолонки, 7, НомерКолонки).Текст);
			НоваяСтрокаДанных.Жир = Число(Данные.Область(8, НомерКолонки, 8, НомерКолонки).Текст);
			
		Исключение
			Сообщить("Введены не корректные данные в дате - "  + ПреобразованнаяДата);
		КонецПопытки;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура Назад(Команда)
	
	ПрочитанныеДанные.Очистить();
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ОсновныеДанныеГруппа;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	СоздатьДокументыНаСервере();
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументыНаСервере()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.СписокСозданныхДокументов;
	
	Для каждого СтрокаТабличнойЧасти Из ПрочитанныеДанные Цикл
		
		НовыйДокумент 													= Документы.ПроизводственнаяСводка.СоздатьДокумент();
		НовыйДокумент.Дата 										= СтрокаТабличнойЧасти.Дата;
		НовыйДокумент.Автор 										= ПараметрыСеанса.ТекущийПользователь;
		НовыйДокумент.МолокоНаВыпойку 				=	СтрокаТабличнойЧасти.Выпойка;
		НовыйДокумент.ВаловыйНадой 						= СтрокаТабличнойЧасти.Надой;
		НовыйДокумент.КоличествоДойныхКоров 	= СтрокаТабличнойЧасти.ДойныхГолов;
		НовыйДокумент.Ферма 										= СтрокаТабличнойЧасти.Ферма;
		НовыйДокумент.Склад 										= СтрокаТабличнойЧасти.Склад;
		НовыйДокумент.КоличествоФуражныхКоров 	= ДанныеЖивотных.КоличествоФуражныхКоров(СтрокаТабличнойЧасти.Ферма, СтрокаТабличнойЧасти.Дата);
		НовыйДокумент.ПроцентныйБелок					= СтрокаТабличнойЧасти.Белок;
		НовыйДокумент.ПроцентныйЖир					= СтрокаТабличнойЧасти.Жир;
		
		НовыйДокумент.ЖирМолока 		= НовыйДокумент.ВаловыйНадой * НовыйДокумент.ПроцентныйЖир / 100;
		НовыйДокумент.БелокМолока 	= НовыйДокумент.ВаловыйНадой * НовыйДокумент.ПроцентныйБелок / 100;
		
		НовыйДокумент.СреднесуточныйУдой 	= НовыйДокумент.ВаловыйНадой / Макс(НовыйДокумент.КоличествоДойныхКоров, 1);
		НовыйДокумент.ТоварностьМолока 		= 100 - НовыйДокумент.МолокоНаВыпойку / Макс(НовыйДокумент.ВаловыйНадой, 1) * 100;
		
		НовыйДокумент.СреднесуточныйУдойФуражный 	= НовыйДокумент.ВаловыйНадой / Макс(НовыйДокумент.КоличествоФуражныхКоров, 1);
		
		НовыйДокумент.Записать();
		
		НоваяСтрока 				= СписокСозданныхДокументов.Добавить();
		НоваяСтрока.Ссылка 	= НовыйДокумент.Ссылка;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура СписокСозданныхДокументов1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.СписокСозданныхДокументов1.ТекущиеДанные;
	
	ОткрытьЗначение(ТекущиеДанные.Ссылка);
	
КонецПроцедуры



