
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь 		= ПараметрыСеанса.ТекущийПользователь;
	ФермаТекущегоПользователя 	= ТекущийПользователь.ОсновнаяФерма;
	
	Если ЗначениеЗаполнено(ФермаТекущегоПользователя) Тогда 
		
		ОтборГруппа				= Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ОтборГруппа.ТипГруппы	= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
		ОтборГруппа.Использование = Истина;   
		ОтборГруппа.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ОтборОтправитель					= ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборОтправитель.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ОтборОтправитель.ПравоеЗначение 	= ФермаТекущегоПользователя;
		ОтборОтправитель.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ФермаОтправитель");
		ОтборОтправитель.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ОтборОтправитель.Использование 		= Истина;
		
		ОтборПолучатель						= ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПолучатель.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ОтборПолучатель.ПравоеЗначение 		= ФермаТекущегоПользователя;
		ОтборПолучатель.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ФермаПолучатель");
		ОтборПолучатель.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ОтборПолучатель.Использование 		= Истина;
		
	КонецЕсли;
	
КонецПроцедуры
