Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыНаСкладах.Записывать 	= Истина;
	Движения.ПроизводствоСводка.Записывать 	= Истина;

	НовоеДвижение 				= Движения.ТоварыНаСкладах.ДобавитьПриход();
	НовоеДвижение.Период		= Дата;
	НовоеДвижение.Склад			= Склад;
	НовоеДвижение.Номенклатура	= Справочники.Номенклатура.Молоко;
	НовоеДвижение.Количество	= ВаловыйНадой;
	
	Если ЗначениеЗаполнено(МолокоНаВыпойку) Тогда
		
		НовоеДвижение 				= Движения.ТоварыНаСкладах.ДобавитьРасход();
		НовоеДвижение.Период		= Дата;
		НовоеДвижение.Склад			= Склад;
		НовоеДвижение.Номенклатура	= Справочники.Номенклатура.Молоко;
		НовоеДвижение.Количество	= МолокоНаВыпойку;
		
	КонецЕсли;
	
	НовоеДвижение 								= Движения.ПроизводствоСводка.Добавить();
	НовоеДвижение.Ферма 						= Ферма;
	НовоеДвижение.КоличествоДойныхКоров 		= КоличествоДойныхКоров;
	НовоеДвижение.Период						= Дата;
	НовоеДвижение.СреднесуточныйУдой 			= СреднесуточныйУдой;
	НовоеДвижение.ТоварностьМолока 				= ТоварностьМолока;
	НовоеДвижение.ЖирМолока 					= ЖирМолока;
	НовоеДвижение.БелокМолока 					= БелокМолока;
	НовоеДвижение.КоличествоФуражныхКоров 		= КоличествоФуражныхКоров;
	НовоеДвижение.СреднесуточныйУдойФуражный 	= СреднесуточныйУдойФуражный;

КонецПроцедуры
