////////////////////////////////////////////////////////////////////////////////
// Модуль предоставляет клиенту интерфейс к серверной части функциональности
// механизма обработки табличной части.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Вызов этой функции должен осуществляться только из клиентского модуля ОбработкаТабличнойЧастиКлиент.
//
Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий) Экспорт
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий)
	
КонецПроцедуры

#КонецОбласти
