
#Region ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
		Объект.Ферма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Автор, "ОсновнаяФерма");
		
        Если Параметры.Свойство("МассивЖивотных") Тогда
			Для Каждого СсылкаЖивотного Из Параметры.МассивЖивотных Цикл
				НоваяСтрока = Объект.Животные.Добавить();
				НоваяСтрока.Животное = СсылкаЖивотного;
				НоваяСтрока.СтараяКличка = СсылкаЖивотного.Наименование;
			КонецЦикла;
        КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТолькоПросмотр = ОграничениеДоступности.ОграничитьДанныеДокумента(Объект.Дата);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекущиеДанные = Элементы.Животные.ТекущиеДанные;
	ТекущиеДанные.Животное = ВыбранноеЗначение;
	ЖивотноеПриИзменении();
	
КонецПроцедуры

#EndRegion

#Region ОбработчикиСобытийЭлементовТаблицыФормыЖивотные

&НаКлиенте
Процедура ЖивотныеЖивотноеПриИзменении(Элемент)
	ЖивотноеПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ЖивотныеЖивотноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) 
	
	Если Объект.Ферма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокПараметров = Новый Массив;
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", ДанныеЖивотных.ПолучитьСписокЖивотныхПоФермеДокумента(Объект.Ферма, Объект.Дата));
	СписокПараметров.Добавить(ПараметрВыбора);
	ФиксированныеПараметры = Новый ФиксированныйМассив(СписокПараметров);
	
	Элемент.ПараметрыВыбора = ФиксированныеПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖивотныеЖивотноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Ферма", Объект.Ферма);
	
	ВзаимодействиеКлиент.ОткрытьФормуВыбораЖивотного(ЭтаФорма, СписокПараметров);
	
КонецПроцедуры

#EndRegion

#Region СлужебныеПроцедурыИФункции

// Вспомогательные процедуры и функции для работы с формой
&НаКлиенте
Процедура ЖивотноеПриИзменении()
	
	ТекущаяСтрока = Элементы.Животные.ТекущиеДанные;
	ТекущаяСтрока.СтараяКличка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Животное, "Кличка");
	
КонецПроцедуры

#EndRegion








