  
  #Область ОбработчикиСобытийФормы 
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура", Номенклатура) Тогда
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			ЗаполнитьСВКорма();	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СВКормаПриИзменении(Элемент)
	РассчитатьДанные();
КонецПроцедуры

&НаКлиенте
Процедура НовоеСВКормаПриИзменении(Элемент)
	РассчитатьДанные();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоВРационеПриИзменении(Элемент)
	РассчитатьДанные();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ЗаполнитьСВКорма();  
КонецПроцедуры 
  	
  #КонецОбласти
  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьДанные()
	
	Если СВКорма > 0 Тогда
		Сальдо = 100 * (НовоеСВКорма - СВКорма) / СВКорма;
	Иначе	
	    Сальдо = 0;
	КонецЕсли;
	
	Если НовоеСВКорма > 0 Тогда
	    КоличествоВРационеПриНовомСВ = КоличествоВРационе * СВКорма / НовоеСВКорма;
	Иначе	
	    КоличествоВРационеПриНовомСВ = 0;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСВКорма()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаПитательностиКормовСрезПоследних.СухоеВещество КАК СухоеВещество
	|ИЗ
	|	РегистрСведений.ТаблицаПитательностиКормов.СрезПоследних(, Номенклатура = &Номенклатура) КАК ТаблицаПитательностиКормовСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СВКорма = Выборка.СухоеВещество;
	Иначе
		СВКорма = 0;
	КонецЕсли;
	
КонецПроцедуры

	
#КонецОбласти
