&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(БольнаяЧасть) Тогда
		Возврат;
	КонецЕсли;
	
	ПЛ = Число(Сред(БольнаяЧасть, 1, 1));
	ПП = Число(Сред(БольнаяЧасть, 2, 1)); 
	ЗЛ = Число(Сред(БольнаяЧасть, 3, 1)); 
	ЗП = Число(Сред(БольнаяЧасть, 4, 1)); 
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВДокумент(Команда)
	
	Строка = "";
	
	Строка = Строка + ?(ПЛ, "1", "0");
	Строка = Строка + ?(ПП, "1", "0");
	Строка = Строка + ?(ЗЛ, "1", "0");
	Строка = Строка + ?(ЗП, "1", "0");
	
	Оповестить("ВыборБольнойЧасти", Строка, ВладелецФормы);
	//ОповеститьОВыборе(Строка);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

