
Процедура ПередЗаписью(Отказ)

	ЗаписатьРодословную = Ложь;
	Если НЕ ЗначениеЗаполнено(Родословная) Тогда
		РодословнаяОбъект = Справочники.РодословнаяЖивотных.СоздатьЭлемент();
		ЗаписатьРодословную = Истина;
	ИначеЕсли Наименование <> Родословная.Наименование Тогда	
		РодословнаяОбъект = Родословная.ПолучитьОбъект(); 
		ЗаписатьРодословную = Истина;
	КонецЕсли;
	
	Если ЗаписатьРодословную Тогда
		РодословнаяОбъект.Наименование 			= Наименование;
		РодословнаяОбъект.Пол 					= Перечисления.ПолЖивотного.Бык;
		РодословнаяОбъект.Кличка 				= Кличка;
		РодословнаяОбъект.КличкаНаАнглийском 	= КличкаНаЛатинице;
		РодословнаяОбъект.ДатаРождения			= ДатаРождения;
		РодословнаяОбъект.Порода                = Порода;
		РодословнаяОбъект.КодСемени             = КодСемени;
		РодословнаяОбъект.Записать(); 
		
		Родословная = РодословнаяОбъект.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры
