
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Автор 	= ПараметрыСеанса.ТекущийПользователь;
		Объект.Ферма 	= Объект.Автор.ОсновнаяФерма;
		Объект.Дата		= ТекущаяДата();
	Конецесли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТолькоПросмотр = ОграничениеДоступности.ОграничитьДанныеДокумента(Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекущиеДанные = Элементы.Животные.ТекущиеДанные;
	ТекущиеДанные.Животное = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖивотныеЖивотноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	ФермаПользователя = ОбщегоНазначения.ПолучитьСвойствоОбъекта(ОбщегоНазначения.ТекущийПользователь(), "ОсновнаяФерма"); 
	Если ЗначениеЗаполнено(ФермаПользователя) И Объект.Ферма <> ФермаПользователя Тогда
	    ПоказатьПредупреждение(,"Ферма в документе не соответствует ферме пользователя: " + ФермаПользователя + ". Выбор невозможен.",10,"Выбор животного");
		Возврат;
	КонецЕсли;
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Ферма", ФермаПользователя);
	СписокПараметров.Вставить("НеобходимоОповестить", Истина);
	
	ВзаимодействиеКлиент.ОткрытьФормуВыбораЖивотного(ЭтаФорма, СписокПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖивотныеЖивотноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ФермаПользователя = ОбщегоНазначения.ПолучитьСвойствоОбъекта(ОбщегоНазначения.ТекущийПользователь(), "ОсновнаяФерма");
	Если ЗначениеЗаполнено(ФермаПользователя) И Объект.Ферма <> ФермаПользователя Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли; 
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", ДанныеЖивотных.ПолучитьСписокЖивотныхПоФермеДокумента(ФермаПользователя, Объект.Дата));
	СписокПараметров = Новый Массив;
	СписокПараметров.Добавить(ПараметрВыбора);
	ФиксированныеПараметры = Новый ФиксированныйМассив(СписокПараметров);
	
	Элемент.ПараметрыВыбора = ФиксированныеПараметры;

КонецПроцедуры











