	 
Функция ВернутьЭлементОтбора(ПолеСКД, НастройкиОтчета, ВидСравненияПоля = Неопределено)

	НайденныйЭлемент = Неопределено;
	Для каждого Элемент Из НастройкиОтчета.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеСКД И (ВидСравненияПоля = Неопределено ИЛИ Элемент.ВидСравнения = ВидСравненияПоля) Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденныйЭлемент;

КонецФункции 

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	КомпоновщикНастроекФормы = ЭтаФорма.Отчет.КомпоновщикНастроек;  
	НастройкиОтчета = КомпоновщикНастроекФормы.ФиксированныеНастройки; 
	
	Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("ДоступКоВсемФермам") Тогда
		ПолеСКДФерма = Новый ПолеКомпоновкиДанных("Ферма");
		ЭлементФерма = ВернутьЭлементОтбора(ПолеСКДФерма,НастройкиОтчета);
		Если ЭлементФерма = Неопределено Тогда
			ЭлементФерма = НастройкиОтчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
			ЭлементФерма.ЛевоеЗначение = ПолеСКДФерма;
		КонецЕсли; 
		ЭлементФерма.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь.ОсновнаяФерма;  
		ЭлементФерма.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементФерма.Использование = Истина;
		
		ЭлементФерма = ВернутьЭлементОтбора(ПолеСКДФерма, КомпоновщикНастроекФормы.Настройки);
		Если ЭлементФерма <> Неопределено Тогда
		    Настройки = КомпоновщикНастроекФормы.Настройки;
			Настройки.Отбор.Элементы.Удалить(ЭлементФерма); 
			КомпоновщикНастроекФормы.ЗагрузитьНастройки(Настройки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	ПриОткрытииНаСервере();  
	
КонецПроцедуры  

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	ПриОткрытииНаСервере();
КонецПроцедуры




