
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
		Объект.Ферма = ПараметрыСеанса.ТекущийПользователь.ОсновнаяФерма; 
		Объект.Дата  = КонецДня(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТолькоПросмотр = ОграничениеДоступности.ОграничитьДанныеДокумента(Объект.Дата);
	УправлениеВидимостью();
	
КонецПроцедуры

//ВЫБОР 
&НаКлиенте
Процедура ПадежЖивотноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОграничениеВыбораПоФерме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПадежЖивотноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОграничениеАвтоПодбораПоФерме(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗабойЖивотноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОграничениеВыбораПоФерме();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗабойЖивотноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОграничениеАвтоПодбораПоФерме(Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияОткормаЖивотноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОграничениеВыбораПоФерме();
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияОткормаЖивотноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОграничениеАвтоПодбораПоФерме(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияПлеменногоПоголовьяЖивотноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОграничениеВыбораПоФерме();
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияПлеменногоПоголовьяЖивотноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОграничениеАвтоПодбораПоФерме(Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажаНаселениюЖивотноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОграничениеВыбораПоФерме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажаНаселениюЖивотноеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОграничениеАвтоПодбораПоФерме(Элемент);
	
КонецПроцедуры

&НаКлиенте
Функция ОграничениеВыбораПоФерме()
	
	СтандартнаяОбработка = Ложь;
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Ферма", Объект.Ферма);
	СписокПараметров.Вставить("НеобходимоОповестить", Истина);
	
	ВзаимодействиеКлиент.ОткрытьФормуВыбораЖивотного(ЭтаФорма, СписокПараметров);
	
КонецФункции

&НаКлиенте
Функция ОграничениеАвтоПодбораПоФерме(Элемент)
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", ДанныеЖивотных.ПолучитьСписокЖивотныхПоФермеДокумента(Объект.Ферма, Объект.Дата));
	СписокПараметров = Новый Массив;
	СписокПараметров.Добавить(ПараметрВыбора);
	ФиксированныеПараметры = Новый ФиксированныйМассив(СписокПараметров);
	
	Элемент.ПараметрыВыбора = ФиксированныеПараметры;

КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекущаяТабличнаяЧасть = ЭтаФорма.ТекущийЭлемент;
	
	ТекущиеДанные = Элементы[ТекущаяТабличнаяЧасть.Имя].ТекущиеДанные;
	
	ТекущиеДанные.Животное = ВыбранноеЗначение;
	
	Отказ = Ложь;
	
	Если Отказ Тогда
		ТекущиеДанные.Животное = ПредопределенноеЗначение("Справочник.Животные.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЖивотныхПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УправлениеВидимостью();
	
КонецПроцедуры

Функция УправлениеВидимостью()

	ТекущаяСтраница = Элементы.ТаблицаЖивотных.ТекущаяСтраница.Имя;
	Элементы.Покупатель.Видимость = ТекущаяСтраница = "РеализацияОткормаГруппа"
									ИЛИ ТекущаяСтраница = "РеализацияПлеменногоПоголовьяГруппа"
									ИЛИ ТекущаяСтраница = "ПродажаНаселениюГруппа";
									

КонецФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент) 
	
	Объект.Дата = КонецДня(Объект.Дата); 
	
КонецПроцедуры



















