&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВопросаЗапись", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Документ должен быть записан перед заполнением. Записать?", РежимДиалогаВопрос.ДаНет);
		Возврат;	
	КонецЕсли;
	
	ВзаимодействиеКлиент.ОткрытьФормуЗаполненияОбъектаНаОснованииФайла(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Функция ЗавершениеВопросаЗапись(ОтветПользователя, Параметры) Экспорт
	
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		Возврат 0;
	КонецЕсли;
	
	//ПОПРОБУЕМ ЗАПИСАТЬ
	
	Попытка 
		
		ЭтотОбъект.Записать();
		
		ВзаимодействиеКлиент.ОткрытьФормуЗаполненияОбъектаНаОснованииФайла(ЭтаФорма, Объект.Ссылка);
		
	Исключение
		
		ВызватьИсключение "Ошибка при попытке записи";
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаполнениеДанныхИзФайлаИндексыБыков" 
						И Источник = ОбщегоНазначения.ТекущийПользователь() Тогда
						
			ТабличнаяЧастьИндексов = Объект.ОсновныеИндексы;
			
			Для каждого СтрокаТабличнойЧасти Из Параметр Цикл
				
				НоваяСтрокаИндексов = ТабличнаяЧастьИндексов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаИндексов, СтрокаТабличнойЧасти);
				
			КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТолькоПросмотр = ОграничениеДоступности.ОграничитьДанныеДокумента(Объект.Дата);
	
КонецПроцедуры
