
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ПеремещениеТоваров.ПолучитьМакет("ПФ_MXL_М11");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Автор КАК Автор,
	|	ПеремещениеТоваров.Дата КАК ДатаСоставления,
	|	ПеремещениеТоваров.Комментарий КАК Комментарий,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.СкладОтправитель КАК Склад,
	|	ПеремещениеТоваров.СкладПолучатель КАК ПредставлениеПодразделения,
	|	ПеремещениеТоваров.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК МатериалНаименование,
	|		Количество КАК Количество,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмеренияНаименование,
	|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод
	|	) КАК Товары
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьТовары = Макет.ПолучитьОбласть("Строка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьЗаголовокТаблицы);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла; 
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
