
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПолучитьФорму("Обработка.СтруктураПодчиненности.Форма.Форма");
	
	//ОПРЕДЕЛИМ ОТКУДА ОТКРЫВАЕТСЯ СТРУКТУРА 
	Если ПараметрыВыполненияКоманды.Источник.Параметры.Свойство("Ключ") Тогда
		Форма.Объект.ОсновнойОбъект = ПараметрыВыполненияКоманды.Источник.Параметры.Ключ;
	Иначе
		Форма.Объект.ОсновнойОбъект = ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.ТекущаяСтрока;
	КонецЕсли;
	Форма.Открыть();
	
КонецПроцедуры

