&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("Ферма") Тогда
		
		Ферма = ЭтаФорма.Параметры["Ферма"];
	КонецЕсли;

	Если ЭтаФорма.Параметры.Свойство("Корпус") Тогда
		
		Корпус = ЭтаФорма.Параметры["Корпус"];
	КонецЕсли;
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьАрхив(Команда)
	
	Элементы.ПоказыватьАрхив.Пометка = Не Элементы.ПоказыватьАрхив.Пометка;
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьБычков(Команда)
	
	Элементы.ПоказыватьБычков.Пометка = Не Элементы.ПоказыватьБычков.Пометка;
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ФермаПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ФермаОчистка(Элемент, СтандартнаяОбработка)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаСервере
Функция УстановитьОтбор()
	
	Список.Отбор.Элементы.Очистить();

	Если ЗначениеЗаполнено(Ферма) Тогда 
		
		Отбор 					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение 	= Ферма;
		Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ферма");
		Отбор.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Отбор.Использование 	= Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Корпус) Тогда 
		
		Отбор 					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение 	= Корпус;
		Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Корпус");
		Отбор.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Отбор.Использование 	= Истина;
		
	КонецЕсли;
	
	Если НЕ Элементы.ПоказыватьАрхив.Пометка Тогда 
		
		Отбор 					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение 		= Ложь;
		Отбор.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Архив");
		Отбор.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Отбор.Использование 		= Истина;
		
	КонецЕсли;	
	
	Если НЕ Элементы.ПоказыватьБычков.Пометка Тогда
		
		Отбор 					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение 		= Перечисления.ПолЖивотного.Корова;
		Отбор.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Пол");
		Отбор.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Отбор.Использование 		= Истина;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Предупреждение("Для введения животного создайте документ 'Рождение животного' или 'Ввод животных'");
	Отказ = Истина;
	
КонецПроцедуры


