
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МассаРаздачиПриИзменении(Элемент)
	РассчитатьКоэффициентКормления();
	РассчитатьСВ();
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентКормленияПриИзменении(Элемент)
	РассчитатьМассуРаздачи();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоГоловПриИзменении(Элемент)
	РассчитатьМассуРаздачи();
КонецПроцедуры

&НаКлиенте
Процедура РационПриИзменении(Элемент)
	Если Объект.МассаРаздачи > 0 Тогда
		РассчитатьКоэффициентКормления();
	Иначе
		РассчитатьМассуРаздачи();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьМассуРаздачи()
	
	Если ЗначениеЗаполнено(Объект.Рацион) Тогда
		ВесРациона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Рацион, "Вес");
		Объект.МассаРаздачи = Объект.КоэффициентКормления * Объект.КоличествоГолов * ВесРациона;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Для расчета массы раздачи заполните рацион.",,"Рацион","Объект");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьКоэффициентКормления()
	
	Если Объект.КоличествоГолов > 0 Тогда
		
		Если ЗначениеЗаполнено(Объект.Рацион) Тогда
			ВесРациона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Рацион, "Вес");
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Для расчета коэффициента кормления заполните рацион.",,"Рацион","Объект");
			Возврат;
		КонецЕсли;
		
		Если ВесРациона <> 0 Тогда
			Объект.КоэффициентКормления = Объект.МассаРаздачи / Объект.КоличествоГолов / ВесРациона;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСВ()
	
	Если НЕ Объект.Рацион.Пустая() И Объект.КоличествоГолов > 0 Тогда
		ПроцентСВ = Справочники.Рационы.ПроцентСВРациона(Объект.Рацион);
		Объект.СВ = Объект.МассаРаздачи * ПроцентСВ / Объект.КоличествоГолов;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти