
&НаКлиенте
Процедура ПоказыватьАрхив(Команда)
	
	Элементы.ПоказыватьАрхив.Пометка = НЕ Элементы.ПоказыватьАрхив.Пометка;
	
	Список.Отбор.Элементы.Очистить();

	Если НЕ Элементы.ПоказыватьАрхив.Пометка Тогда 
		
		Отбор 											= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения 				= ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение 			= Ложь;
		Отбор.ЛевоеЗначение 			= Новый ПолеКомпоновкиДанных("НеРаботает");
		Отбор.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Отбор.Использование 				= Истина;
		
	КонецЕсли;	
	
	РассчитатьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоги()
	
	СхемаКомпоновкиДанных 	= Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиСКД 			= Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета 		= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки			= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиСКД,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки 	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода 		= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	ИтогTPI 	= Результат.Итог("TPI") / Макс(1, Результат.Количество());
	ИтогNM 		= Результат.Итог("NM") / Макс(1, Результат.Количество());
	ИтогМолоко	= Результат.Итог("Молоко") / Макс(1, Результат.Количество());
	ИтогCCR 	= Результат.Итог("CCR") / Макс(1, Результат.Количество());
	ИтогHCR 	= Результат.Итог("HCR") / Макс(1, Результат.Количество());
	ИтогPL 		= Результат.Итог("PL") / Макс(1, Результат.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоказыватьАрхив(Неопределено);
	
	ОбновитьДанныеПоИтогам();
	
КонецПроцедуры

&НаКлиенте
Функция ОбновитьДанныеПоИтогам()
	
	РассчитатьИтоги();
	
КонецФункции
