&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Автор 	= ПараметрыСеанса.ТекущийПользователь;
		Объект.Ферма 	= Объект.Автор.ОсновнаяФерма;
		Объект.Дата		= ТекущаяДата();
	Конецесли;

КонецПроцедуры

&НаКлиенте
Процедура ЖивотныеМатьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Ферма", Объект.Ферма);
	СтуктураОтбор = Новый Структура;
	СтуктураОтбор.Вставить("Состояние", ПредопределенноеЗначение("Перечисление.СтатусЖивотного.Стельная"));
	СписокПараметров.Вставить("Отбор", СтуктураОтбор);
	СписокПараметров.Вставить("НеобходимоОповестить", Истина);
	
	ВзаимодействиеКлиент.ОткрытьФормуВыбораЖивотного(ЭтаФорма, СписокПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекущиеДанные = Элементы.Животные.ТекущиеДанные;
	ТекущиеДанные.Мать = ВыбранноеЗначение;
	Если ЗначениеЗаполнено(ТекущиеДанные.Мать) Тогда
		ТекущиеДанные.Осеменатор = ПоследнийОсеменатор(Объект.Дата,ТекущиеДанные.Мать);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖивотныеМатьАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", ДанныеЖивотных.ПолучитьСписокЖивотныхПоФермеДокумента(Объект.Ферма, Объект.Дата,,ПредопределенноеЗначение("Перечисление.СтатусЖивотного.Стельная")));
	СписокПараметров = Новый Массив;
	СписокПараметров.Добавить(ПараметрВыбора);
	ФиксированныеПараметры = Новый ФиксированныйМассив(СписокПараметров);
	
	Элемент.ПараметрыВыбора = ФиксированныеПараметры;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТолькоПросмотр = ОграничениеДоступности.ОграничитьДанныеДокумента(Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖивотныеМатьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Животные.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Мать) Тогда
		ТекущиеДанные.Осеменатор = ПоследнийОсеменатор(Объект.Дата,ТекущиеДанные.Мать);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоследнийОсеменатор(Дата,Животное)
	
	Осеменатор = Справочники.Сотрудники.ПустаяСсылка(); 
	ВыборкаПоследнегоОСеменения = Документы.Осеменение.ДанныеПоследнегоОсеменения(Дата,Животное);
	Если ВыборкаПоследнегоОСеменения <> Неопределено Тогда
		Осеменатор = ВыборкаПоследнегоОСеменения.Осеменатор; 
	КонецЕсли;
	Возврат Осеменатор;

КонецФункции // ПоследнийОсеменатор()












