
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
    
	Если  ДокументРезультат.Рисунки.Количество() = 2 Тогда
	//Здесь перемещаем диаграммы        
        ДокументРезультат.Рисунки[0].Лево = ДокументРезультат.Рисунки[1].Лево - 20;
        ДокументРезультат.Рисунки[1].Верх = ДокументРезультат.Рисунки[1].Верх - 120;
        ДокументРезультат.Рисунки[1].Лево = ДокументРезультат.Рисунки[1].Лево + 50;
	КонецЕсли;
КонецПроцедуры
