
&НаСервере
Процедура ПриОткрытииНаСервере()    
	
	КомпоновщикНастроекФормы = ЭтаФорма.Отчет.КомпоновщикНастроек;  
	НастройкиОтчета = КомпоновщикНастроекФормы.Настройки; 
	ПолеСКДФерма = Новый ПараметрКомпоновкиДанных("Ферма");
	ЭлементФерма = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Ферма"); 
	
	Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("ДоступКоВсемФермам") Тогда
		ЭлементФерма.Значение 			= ПараметрыСеанса.ТекущийПользователь.ОсновнаяФерма;  
		ЭлементФерма.Использование 		= Истина;  
		ЭлементФерма.РежимОтображения   = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
		ЭлементФерма.ИдентификаторПользовательскойНастройки = "ДоступКоВсемФермам"; 
		ЭлементФерма.РежимОтображения   = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	ПриОткрытииНаСервере();  
КонецПроцедуры  

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	ПриОткрытииНаСервере();
КонецПроцедуры










