
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)  
	
    СтандартнаяОбработка = Ложь;
    Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки); 
	
    ПараметрПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
    НачальнаяДата = ПараметрПериод.Значение.ДатаНачала;
    КонечнаяДата = ПараметрПериод.Значение.ДатаОкончания;   
	
    ТаблицаЦиклов = ПолучитьТаблицуЦиклов(300);
	Запрос = Новый Запрос;  
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТаблицаЦиклов ИЗ &ТаблицаЦиклов КАК ТаблицаЦиклов";
	Запрос.УстановитьПараметр("ТаблицаЦиклов", ТаблицаЦиклов);
	Запрос.Выполнить();    
	
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки,,,МВТ);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры 

Функция ПолучитьТаблицуЦиклов(КоличествоДней)
	
	КоличествоДнейВЦикле = 4; 
	
	КвЧисла = Новый КвалификаторыЧисла(5,0);
	ТаблицаЦиклов = Новый ТаблицаЗначений; 
    ТаблицаЦиклов.Колонки.Добавить("НачалоЦикла",Новый ОписаниеТипов("Число",,,КвЧисла));
    ТаблицаЦиклов.Колонки.Добавить("ОкончаниеЦикла",Новый ОписаниеТипов("Число",,,КвЧисла)); 
	КоличествоЦиклов = Окр(КоличествоДней / КоличествоДнейВЦикле, 0, РежимОкругления.Окр15как10) + ?(КоличествоДней % КоличествоДнейВЦикле > 0, 1, 0); 
	
	Для Счетчик = 1 По КоличествоЦиклов Цикл  
		
        НоваяСтрока = ТаблицаЦиклов.Добавить();
        НоваяСтрока.ОкончаниеЦикла 	= Счетчик * КоличествоДнейВЦикле; 
        НоваяСтрока.НачалоЦикла 	= НоваяСтрока.ОкончаниеЦикла - КоличествоДнейВЦикле + 1;
		
	КонецЦикла; 
	
	Возврат ТаблицаЦиклов;
	
КонецФункции // ПолучитьТаблицуЦиклов()
