
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки(); 

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Нашел = Истина;
	
	Пока Нашел Цикл
		Область = ДокументРезультат.НайтиТекст("Удалить %");
		Если Область = Неопределено Тогда
			Нашел = Ложь;
			Продолжить;
		КонецЕсли;
		
		Область.Текст = "";
	КонецЦикла;
	
	Нашел = Истина;
	Пока Нашел Цикл
		Область = ДокументРезультат.НайтиТекст("Свернуть");
		Если Область = Неопределено Тогда
			Нашел = Ложь;
			Продолжить;
		КонецЕсли;
		
		ОбъединитьОбласть = ДокументРезультат.Область("R" + (Область.Верх - 1) + "C" + Область.Лево + ":R" + Область.Низ + "C" + (Область.Право));
		ОбъединитьОбласть.Объединить();
		
	КонецЦикла;

	
КонецПроцедуры
