 
Процедура ПроверитьНеобходимостьОбновленияИБ() Экспорт
 
 	Если НеобходимоОбновлениеИнформационнойБазы() Тогда
	
		ОбновитьИБ();	
	
	КонецЕсли;	
 
КонецПроцедуры

Процедура ОбновитьИБ()
	
	ВерсияКонфигурации = Метаданные.Версия;
	Если ВерсияКонфигурации = "1.1.3" Тогда
	
		//Код обработчика обновления	
	
	КонецЕсли;
	Константы.ВерсияКонфигурацииИБ.Установить(ВерсияКонфигурации);		

КонецПроцедуры
 
Функция НеобходимоОбновлениеИнформационнойБазы()
	
	ВерсияИБ = Константы.ВерсияКонфигурацииИБ.Получить();
	
	Возврат ВерсияИБ <> Метаданные.Версия;
	
КонецФункции
