
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборПоДатеОкончания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОтборПоДатеОкончания()
	
	ЭлементыОтбора = ПодборТоваровСервер.ПолучитьОтборДинамическогоСписка(ЭтотОбъект.Список);
	
	ПодборТоваровСервер.УстановитьЭлементОтбора(
		ЭлементыОтбора,
		"ДатаОкончанияДействия",
		,
		ВидСравненияКомпоновкиДанных.НеЗаполнено,
		"ОтборПоДатеОкончания",
		Истина);
	
	КонецПроцедуры
	
#КонецОбласти


