
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Выбытия.Записывать 				= Истина;
	Движения.РазмещениеЖивотных.Записывать 		= Истина;
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	
	Для каждого СтрокаТабличнойЧасти Из Падеж Цикл
		
		НовоеДвижение 				= Движения.Выбытия.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка; 
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТабличнойЧасти);
		НовоеДвижение.СпособВыбытия	= Перечисления.СпособыВыбытия.Падеж;
		
		НовоеДвижение 				= Движения.РазмещениеЖивотных.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Животное 		= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Корпус		= Справочники.Корпуса.ПустаяСсылка();
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Ферма			= Справочники.Фермы.ПустаяСсылка(); 
		
	КонецЦикла;
	
	Для каждого СтрокаТабличнойЧасти Из Забой Цикл
		
		НовоеДвижение 				= Движения.Выбытия.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТабличнойЧасти);
		НовоеДвижение.СпособВыбытия	= Перечисления.СпособыВыбытия.Забой;
		
		НовоеДвижение 				= Движения.РазмещениеЖивотных.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Животное 		= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Корпус		= Справочники.Корпуса.ПустаяСсылка();
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Ферма			= Справочники.Фермы.ПустаяСсылка();
		
	КонецЦикла;
	
	Для каждого СтрокаТабличнойЧасти Из РеализацияОткорма Цикл
		
		НовоеДвижение 				= Движения.Выбытия.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТабличнойЧасти); 
		НовоеДвижение.СпособВыбытия	= Перечисления.СпособыВыбытия.РеализацияОткорма;
		
		НовоеДвижение 				= Движения.РазмещениеЖивотных.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Животное 		= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Корпус		= Справочники.Корпуса.ПустаяСсылка();
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Ферма			= Справочники.Фермы.ПустаяСсылка();
		
		НовоеДвижение 				= Движения.ВзаиморасчетыСКлиентами.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Контрагент 	= Покупатель;
		НовоеДвижение.Номенклатура 	= Справочники.Номенклатура.Животное;
		НовоеДвижение.Сумма 		= СтрокаТабличнойЧасти.Стоимость;
		НовоеДвижение.Цена			= СтрокаТабличнойЧасти.Цена;
		НовоеДвижение.Количество	= 1;
		
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из РеализацияПлеменногоПоголовья Цикл
		
		НовоеДвижение 				= Движения.Выбытия.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТабличнойЧасти); 
		НовоеДвижение.СпособВыбытия	= Перечисления.СпособыВыбытия.РеализацияПлеменногоПоголовья;
		
		НовоеДвижение 				= Движения.РазмещениеЖивотных.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Животное 		= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Корпус		= Справочники.Корпуса.ПустаяСсылка();
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Ферма			= Справочники.Фермы.ПустаяСсылка();
		
		НовоеДвижение 				= Движения.ВзаиморасчетыСКлиентами.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Контрагент 	= Покупатель;
		НовоеДвижение.Номенклатура 	= Справочники.Номенклатура.Животное;
		НовоеДвижение.Сумма 		= СтрокаТабличнойЧасти.Стоимость;
		НовоеДвижение.Цена			= СтрокаТабличнойЧасти.Цена;
		НовоеДвижение.Количество	= 1;
		
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из ПродажаНаселению Цикл
		
		НовоеДвижение 				= Движения.Выбытия.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТабличнойЧасти); 
		НовоеДвижение.СпособВыбытия	= Перечисления.СпособыВыбытия.ПродажаНаселению;
		
		НовоеДвижение 				= Движения.РазмещениеЖивотных.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Животное 		= СтрокаТабличнойЧасти.Животное;
		НовоеДвижение.Корпус		= Справочники.Корпуса.ПустаяСсылка();
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Ферма			= Справочники.Фермы.ПустаяСсылка();
		
		НовоеДвижение 				= Движения.ВзаиморасчетыСКлиентами.Добавить();
		НовоеДвижение.Период 		= Дата;
		НовоеДвижение.Регистратор 	= Ссылка;
		НовоеДвижение.Контрагент 	= Покупатель;
		НовоеДвижение.Номенклатура 	= Справочники.Номенклатура.Животное;
		НовоеДвижение.Сумма 		= СтрокаТабличнойЧасти.Стоимость;
		НовоеДвижение.Цена			= СтрокаТабличнойЧасти.Цена;
		НовоеДвижение.Количество	= 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПадежПредставление 							= "";
	ЗабойПредставление 							= "";
	РеализацияОткормаПредставление 				= "";
	РеализацияПлеменногоПоголовьяПредставление 	= "";
	ПродажаНаселениюПредставление	 			= "";
	
	Для каждого СтрокаТабличнойЧасти Из Падеж Цикл
		
		Если ЗначениеЗаполнено(ПадежПредставление) Тогда
			ПадежПредставление = ПадежПредставление + ", ";
		КонецЕсли;
		
		ПадежПредставление = ПадежПредставление + СтрокаТабличнойЧасти.Животное;
		
	КонецЦикла;
	
	Для каждого СтрокаТабличнойЧасти Из Забой Цикл
		
		Если ЗначениеЗаполнено(ЗабойПредставление) Тогда
			ЗабойПредставление = ЗабойПредставление + ", ";
		КонецЕсли;
		
		ЗабойПредставление = ЗабойПредставление + СтрокаТабличнойЧасти.Животное;
		
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из РеализацияОткорма Цикл
		
		Если ЗначениеЗаполнено(РеализацияОткормаПредставление) Тогда
			РеализацияОткормаПредставление = РеализацияОткормаПредставление + ", ";
		КонецЕсли;
		
		РеализацияОткормаПредставление = РеализацияОткормаПредставление + СтрокаТабличнойЧасти.Животное;
		
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из РеализацияПлеменногоПоголовья Цикл
		
		Если ЗначениеЗаполнено(РеализацияПлеменногоПоголовьяПредставление) Тогда
			РеализацияПлеменногоПоголовьяПредставление = РеализацияПлеменногоПоголовьяПредставление + ", ";
		КонецЕсли;
		
		РеализацияПлеменногоПоголовьяПредставление = РеализацияПлеменногоПоголовьяПредставление + СтрокаТабличнойЧасти.Животное;
		
	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из ПродажаНаселению Цикл
		
		Если ЗначениеЗаполнено(ПродажаНаселениюПредставление) Тогда
			ПродажаНаселениюПредставление = ПродажаНаселениюПредставление + ", ";
		КонецЕсли;
		
		ПродажаНаселениюПредставление = ПродажаНаселениюПредставление + СтрокаТабличнойЧасти.Животное;
		
	КонецЦикла;

	
	
КонецПроцедуры







