Функция ПолучитьПоляЗаполнения() Экспорт
	
	МассивПолейЗаполнения = Новый Массив;
	
	//БЫК
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 										"Бык");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Бык             ");
	СтруктураДанных.Вставить("Тип", 								Тип("СправочникСсылка.БыкиПлеменные"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//TPI
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 												"TPI");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	СтруктураДанных.Вставить("ИмяКолонки", 								"TPI            ");
	СтруктураДанных.Вставить("Тип", 												Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 				Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//NM
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 												"NM");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	СтруктураДанных.Вставить("ИмяКолонки", 								"NM				");
	СтруктураДанных.Вставить("Тип", 												Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 				Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);

	//Молоко
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 												"Молоко");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	СтруктураДанных.Вставить("ИмяКолонки", 								"Молоко		");
	СтруктураДанных.Вставить("Тип", 												Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 				Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);

	//PL
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 												"PL");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	СтруктураДанных.Вставить("ИмяКолонки", 								"PL				");
	СтруктураДанных.Вставить("Тип", 												Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 				Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);

	//CCR
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 												"CCR");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	СтруктураДанных.Вставить("ИмяКолонки", 								"CCR			");
	СтруктураДанных.Вставить("Тип", 												Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 				Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);

	//HCR
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 												"HCR");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ОсновныеИндексы");
	СтруктураДанных.Вставить("ИмяКолонки", 								"HCR			");
	СтруктураДанных.Вставить("Тип", 												Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 				Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);

	Возврат МассивПолейЗаполнения;
	
КонецФункции
