
&НаКлиенте
Процедура ВыгрузитьПредприятия(Команда)
	ВыгрузитьДанныеНаСервере("Предприятия");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьХозяйства(Команда)
	ВыгрузитьДанныеНаСервере("Хозяйства");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФермы(Команда)
	ВыгрузитьДанныеНаСервере("Фермы");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКормораздатчики(Команда)
	ВыгрузитьДанныеНаСервере("Кормораздатчики");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьГруппыЖивотных(Команда)
	ВыгрузитьДанныеНаСервере("ГруппыЖивотных");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКорма(Команда)
	ВыгрузитьДанныеНаСервере("Корма");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТрактористов(Команда)
	ВыгрузитьДанныеНаСервере("Трактористы");
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДанныеНаСервере(ИмяДанных) 
	
	РезультатОбмена = ОбменДанными.ОтправитьДанные(ИмяДанных);	 
	КодСостояния = РезультатОбмена.КодСостояния;
	Результат = РезультатОбмена.ОтветСервера; 
	
КонецПроцедуры
