
Функция ПолучитьДатуПрошлойОхотыЖивотного(Животное, ДатаАкт) Экспорт
	
	Если ДатаАкт = 0 Тогда
		ДатаАкт = КонецДня(ТекущаяДата());
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Животное", Животное);
	Запрос.Параметры.Вставить("ДатаАкт",  ДатаАкт);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОхотаУЖивотныхСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ОхотаУЖивотных.СрезПоследних(&ДатаАкт, Животное = &Животное) КАК ОхотаУЖивотныхСрезПоследних";
	
	табРез = Запрос.Выполнить().Выгрузить();
	
	
	Возврат ?(табРез.Количество()>0,табРез[0].Период, Дата(1,1,1));
	
КонецФункции