#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Для Каждого СтрокаТЧ Из Животные Цикл
		
		РеквизитыЖивотного = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.Животное, "Кличка, Бирка");
		
		Если РеквизитыЖивотного.Кличка = СтрокаТЧ.НоваяКличка Тогда
			Продолжить;
		КонецЕсли;
		
		ЖивотноеОбъект = СтрокаТЧ.Животное.ПолучитьОбъект();
		ЖивотноеОбъект.Кличка = СтрокаТЧ.НоваяКличка;
		Бирка = РеквизитыЖивотного.Бирка;
		ЖивотноеОбъект.Наименование = Строка(Бирка) + " " + СтрокаТЧ.НоваяКличка;
		ЖивотноеОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли