
&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	
	РазделУчета = "РодословнаяЖивотных";
	
	ВзаимодействиеКлиент.ОткрытьФормуЗаполненияОбъектаНаОснованииФайла(ЭтаФорма, ПредопределенноеЗначение("Справочник.РодословнаяЖивотных.ПустаяСсылка"), РазделУчета);
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаполнениеДанныхИзФайлаРодословнаяЖивотных" 
						И Источник = ОбщегоНазначения.ТекущийПользователь() Тогда
						
		ЗаполнитьНаОснованииФайлаНаСервере(Параметр);
		Элементы.Список.Обновить();
		Сообщить("Создание родословных завершено");
						
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОснованииФайлаНаСервере(Параметр)
	
	Параметр.Сортировать("РядРодословной Убыв");
	
	Для каждого СтрокаТабличнойЧасти Из Параметр Цикл
		
		СтрокаТабличнойЧасти.ИдентификационныйНомер = СтрЗаменить(СтрокаТабличнойЧасти.ИдентификационныйНомер, " ", "");
		НаименованиеРодословной = ОбщегоНазначения.ПолучитьНаименованиеРодословной(СтрокаТабличнойЧасти);
		Если СтрокаТабличнойЧасти.Пол = 3 Тогда
			ПолЖивотного = ПредопределенноеЗначение("Перечисление.ПолЖивотного.Бык");
		Иначе
			ПолЖивотного = ПредопределенноеЗначение("Перечисление.ПолЖивотного.Корова");
		КонецЕсли;
		
		Породность = (СтрокаТабличнойЧасти.Породность = 5);
		
		Родословная = НайтиРодословнуюПоНомеру(СтрокаТабличнойЧасти.ИдентификационныйНомер);
		Если ЗначениеЗаполнено(Родословная) Тогда
			СпрОбъект = Родословная.ПолучитьОбъект();
		Иначе	
			Если ПолЖивотного = ПредопределенноеЗначение("Перечисление.ПолЖивотного.Бык") Тогда
				Родословная = НайтиРодословнуюПоНаименованию(НаименованиеРодословной);
			КонецЕсли;
			Если ЗначениеЗаполнено(Родословная) Тогда
				СпрОбъект = Родословная.ПолучитьОбъект();
			Иначе
				СпрОбъект = Справочники.РодословнаяЖивотных.СоздатьЭлемент();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СпрОбъект, СтрокаТабличнойЧасти);
		СпрОбъект.Пол = ПолЖивотного;
		СпрОбъект.Породность = Породность;
		
		Если СпрОбъект.КличкаНаАнглийском = "NULL" Тогда
			СпрОбъект.КличкаНаАнглийском = "";
		КонецЕсли;
		СпрОбъект.ЛинейнаяПринадлежность = СтрокаТабличнойЧасти.Линия;
		
		СпрОбъект.Наименование = НаименованиеРодословной;
		СпрОбъект.Отец = НайтиРодословнуюПоНомеру(СтрокаТабличнойЧасти.НомерОтца);
		СпрОбъект.Мать = НайтиРодословнуюПоНомеру(СтрокаТабличнойЧасти.НомерМатери);
		
		СпрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция НайтиРодословнуюПоНомеру(ИдентификационныйНомер)
	
	НайденныйЭлемент = Неопределено;
	Если ЗначениеЗаполнено(ИдентификационныйНомер) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РодословнаяЖивотных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РодословнаяЖивотных КАК РодословнаяЖивотных
		|ГДЕ
		|	РодословнаяЖивотных.ИдентификационныйНомер = &ИдентификационныйНомер";
		Запрос.УстановитьПараметр("ИдентификационныйНомер", ИдентификационныйНомер);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			НайденныйЭлемент = Выборка.Ссылка;
		КонецЕсли;		
	
	КонецЕсли;
	
	Возврат НайденныйЭлемент;

КонецФункции // НайтиРодителяПоНомеру()  

&НаСервереБезКонтекста
Функция НайтиРодословнуюПоНаименованию(НаименованиеРодословной)  
	
	НайденныйЭлемент = Неопределено;
	Если ЗначениеЗаполнено(НаименованиеРодословной) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РодословнаяЖивотных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РодословнаяЖивотных КАК РодословнаяЖивотных
		|ГДЕ
		|	РодословнаяЖивотных.Наименование = &НаименованиеРодословной";
		Запрос.УстановитьПараметр("НаименованиеРодословной", НаименованиеРодословной);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			НайденныйЭлемент = Выборка.Ссылка;
		КонецЕсли;		
	
	КонецЕсли;

	Возврат Выборка.Ссылка;

КонецФункции // НайтиРодословнуюПоНаименованию()  



