
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Дата = НачалоДня(ТекущаяДата()) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
    Для каждого Строчка Из Животные Цикл
		
		Если Строчка.Животное.БиркаХорриот <> Строчка.БиркаХорриот Тогда
			ЖивотноеОбъект = Строчка.Животное.ПолучитьОбъект();	
		    ЖивотноеОбъект.БиркаХорриот = Строчка.БиркаХорриот;
			ЖивотноеОбъект.Записать();	
		КонецЕсли; 
		
		Родословная = Строчка.Животное.Родословная;
		Если НЕ Родословная.Пустая() И Родословная.БиркаХорриот <> Строчка.БиркаХорриот Тогда
			РодословнаяОбъект = Родословная.ПолучитьОбъект();	
		    РодословнаяОбъект.БиркаХорриот = Строчка.БиркаХорриот;
			РодословнаяОбъект.Записать();	
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для каждого Строчка Из Животные Цикл 
		ДлинаБирки = СтрДлина(СокрЛП(Строчка.БиркаХорриот));
		Если ДлинаБирки < 11 Тогда
			ТекстОшибки = СтрШаблон("Строка %1: длина бирки должна быть 11 символов. Текущая длина - %2.", Строчка.НомерСтроки, ДлинаБирки) + Символы.ПС;
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,"Животные["+Строка(Строчка.НомерСтроки-1)+"].БиркаХорриот","Объект",Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
