&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДанныеКоллекцияОсновнойФормы = ВладелецФормы.Объект.Животные;
	
	Для каждого СтрокаКоллекции Из ДанныеКоллекцияОсновнойФормы Цикл
		
		Если Не СтрокаКоллекции.ПолТеленка = ПредопределенноеЗначение("Перечисление.ПолЖивотного.Корова") Тогда
			
			Продолжить;
		КонецЕсли;
			
		НоваяСтрокаСписка = СписокЖивотных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСписка, СтрокаКоллекции);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЖивотныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповестить("СвязьЖивотногоИДопИнформации", Элементы.СписокЖивотных.ТекущиеДанные.ПолеСвязи, ВладелецФормы);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЖивотныхПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

