
&НаКлиенте
Процедура ОткрытьФормуСправочника(Команда)
	
	СправочникИмя = ЭтаФорма.ТекущийЭлемент.Имя;
	
	ОткрытьФорму("Справочник." + СправочникИмя + ".ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДокумента(Команда)
	
	ДокументИмя = ЭтаФорма.ТекущийЭлемент.Имя;
	
	ОткрытьФорму("Документ." + ДокументИмя + ".ФормаСписка.")
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	
	ОтчетИмя = ЭтаФорма.ТекущийЭлемент.Имя;
	
	ОткрытьФорму("Отчет." + ОтчетИмя + ".Форма");
	
КонецПроцедуры
