
&НаКлиенте
Перем ДанныеВыделенныхСтрок;
	 
Функция ВернутьЭлементОтбора(ПолеСКД, НастройкиОтчета, ВидСравненияПоля = Неопределено)

	НайденныйЭлемент = Неопределено;
	Для каждого Элемент Из НастройкиОтчета.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеСКД И (ВидСравненияПоля = Неопределено ИЛИ Элемент.ВидСравнения = ВидСравненияПоля) Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденныйЭлемент;

КонецФункции 

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	КомпоновщикНастроекФормы = ЭтаФорма.Отчет.КомпоновщикНастроек;  
	НастройкиОтчета = КомпоновщикНастроекФормы.ФиксированныеНастройки; 
	
	Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("ДоступКоВсемФермам") Тогда
		ПолеСКДФерма = Новый ПолеКомпоновкиДанных("Ферма");
		ЭлементФерма = ВернутьЭлементОтбора(ПолеСКДФерма,НастройкиОтчета);
		Если ЭлементФерма = Неопределено Тогда
			ЭлементФерма = НастройкиОтчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
			ЭлементФерма.ЛевоеЗначение = ПолеСКДФерма;
		КонецЕсли; 
		ЭлементФерма.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь.ОсновнаяФерма;  
		ЭлементФерма.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементФерма.Использование = Истина;
		
		ЭлементФерма = ВернутьЭлементОтбора(ПолеСКДФерма, КомпоновщикНастроекФормы.Настройки);
		Если ЭлементФерма <> Неопределено Тогда
		    Настройки = КомпоновщикНастроекФормы.Настройки;
			Настройки.Отбор.Элементы.Удалить(ЭлементФерма); 
			КомпоновщикНастроекФормы.ЗагрузитьНастройки(Настройки);
		КонецЕсли;
	КонецЕсли;
	
	НастройкиОтчета 	= КомпоновщикНастроекФормы.Настройки;  
	ПолеСКДДойныхДней 	= Новый ПолеКомпоновкиДанных("ДойныхДней");
	ВидСравненияПоля 			= ВидСравненияКомпоновкиДанных.БольшеИлиРавно; 
	ЭлементКоличествоОтёловС 	= ВернутьЭлементОтбора(ПолеСКДДойныхДней,НастройкиОтчета,ВидСравненияПоля);
	Если ЭлементКоличествоОтёловС = Неопределено Тогда
		ЭлементКоличествоОтёловС 				= НастройкиОтчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		ЭлементКоличествоОтёловС.ЛевоеЗначение 	= ПолеСКДДойныхДней;
		ЭлементКоличествоОтёловС.ВидСравнения 	= ВидСравненияПоля;  
		ЭлементКоличествоОтёловС.Использование	= Ложь;
		ЭлементКоличествоОтёловС.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;   
	ДнейЛактацииС = ЭлементКоличествоОтёловС.ПравоеЗначение; 
	ДнейЛактацииИспользование = ЭлементКоличествоОтёловС.Использование; 
	
	ВидСравненияПоля			= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно; 
	ЭлементКоличествоОтёловПо 	= ВернутьЭлементОтбора(ПолеСКДДойныхДней,НастройкиОтчета,ВидСравненияПоля);
	Если ЭлементКоличествоОтёловПо = Неопределено Тогда
		ЭлементКоличествоОтёловПо 				= НастройкиОтчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		ЭлементКоличествоОтёловПо.ЛевоеЗначение	= ПолеСКДДойныхДней;
		ЭлементКоличествоОтёловПо.ВидСравнения 	= ВидСравненияПоля;
		ЭлементКоличествоОтёловПо.Использование	= Ложь; 
		ЭлементКоличествоОтёловПо.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	ДнейЛактацииПо = ЭлементКоличествоОтёловПо.ПравоеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	ПриОткрытииНаСервере();  
	
КонецПроцедуры  

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДнейЛактацииПриИзменении(Элемент)    
	
	Если ДнейЛактацииС <> 0 ИЛИ ДнейЛактацииПо <> 0 Тогда
		ДнейЛактацииИспользование = Истина;
	КонецЕсли;
    ИзменитьОтборНаСервере("ДойныхДней",ВидСравненияКомпоновкиДанных.БольшеИлиРавно,ДнейЛактацииС,ДнейЛактацииИспользование); 
    ИзменитьОтборНаСервере("ДойныхДней",ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,ДнейЛактацииПо,(ДнейЛактацииИспользование И ДнейЛактацииПо <> 0));

КонецПроцедуры   

&НаСервере
Процедура ИзменитьОтборНаСервере(ИмяОтбора,ВидСравненияПоля,Значение,Использование)

	КомпоновщикНастроекФормы 	= Отчет.КомпоновщикНастроек;  
	НастройкиОтчета				= КомпоновщикНастроекФормы.Настройки;  
	ПолеСКД 					= Новый ПолеКомпоновкиДанных(ИмяОтбора);
	ЭлементСКД 					= ВернутьЭлементОтбора(ПолеСКД,НастройкиОтчета,ВидСравненияПоля);  
	ЭлементСКД.ПравоеЗначение 	= Значение; 
	ЭлементСКД.Использование	= Использование; 

КонецПроцедуры

&НаКлиенте
Процедура ДнейЛактацииПоИспользованиеПриИзменении(Элемент) 
	
    ИзменитьОтборНаСервере("ДойныхДней",ВидСравненияКомпоновкиДанных.БольшеИлиРавно,ДнейЛактацииС,ДнейЛактацииИспользование); 
    ИзменитьОтборНаСервере("ДойныхДней",ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,ДнейЛактацииПо,ДнейЛактацииИспользование);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	
    ПодключитьОбработчикОжидания("ВыделитьТекущиеСтроки", 0.1, Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыделитьТекущиеСтроки()    
	
	ОтчетыКлиент.ВыделитьТекущиеСтроки(Результат,ДанныеВыделенныхСтрок); 
	
КонецПроцедуры





