Функция ПолучитьПоляЗаполнения() Экспорт
	
	МассивПолейЗаполнения = Новый Массив;
	
	//КЛИЧКА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"Кличка");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Кличка");
	СтруктураДанных.Вставить("Тип", 								Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//БИРКА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"Бирка");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Бирка");
	СтруктураДанных.Вставить("Тип", 								Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//НОМЕР ЖИВОТНОГО
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"НомерЖивотного");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Номер животного");
	СтруктураДанных.Вставить("Тип", 								Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ДАТА РОЖДЕНИЯ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"ДатаРождения");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Дата рождения");
	СтруктураДанных.Вставить("Тип", 								Тип("Дата"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ВЕС ТЕЛЕНКА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"ВесТеленка");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Вес теленка");
	СтруктураДанных.Вставить("Тип", 								Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ПОЛ ТЕЛЕНКА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"ПолТеленка");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Пол теленка");
	СтруктураДанных.Вставить("Тип", 								Тип("ПеречислениеСсылка.ПолЖивотного"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//КОРПУС РАЗМЕЩЕНИЯ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"КорпусРазмещения");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Корпус размещения");
	СтруктураДанных.Вставить("Тип", 								Тип("СправочникСсылка.Корпуса"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);

	
	//МАТЬ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 								"Мать");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 						"Мать");
	СтруктураДанных.Вставить("Тип", 								Тип("СправочникСсылка.Животные"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 			Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ОТЕЦ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Отец");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Отец");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.БыкиПлеменные"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//МЕСТО РОЖДЕНИЯ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"МестоРождения");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"Животные");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Место рождения");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Фермы"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//КОЛИЧЕСТВО ОСЕМЕНЕНИЙ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КоличествоОсеменений");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Количество Осеменений");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//СЕМЯ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Семя");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Семя");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Номенклатура"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ДАТА ПОСЛЕДНЕГО ОСЕМЕНЕНИЯ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"ДатаПоследнегоОсеменения");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Дата последнего осеменения");
	СтруктураДанных.Вставить("Тип", 					Тип("Дата"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ДАТА ПОСЛЕДНЕГО УЗИ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"ДатаПоследнегоУЗИ");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Дата последнего УЗИ");
	СтруктураДанных.Вставить("Тип", 					Тип("Дата"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//СТАТУС ЖИВОТНОГО
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"СтатусЖивотного");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Статус животного");
	СтруктураДанных.Вставить("Тип", 					Тип("ПеречислениеСсылка.СтатусЖивотного"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//КОЛИЧЕСТВО ОТЕЛОВ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КоличествоОтелов");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Количество отелов");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	//ДАТА ПОСЛЕДНЕГО ОТЕЛА
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"ДатаПоследнегоОтела");
	СтруктураДанных.Вставить("НазваниеТабличнойЧасти", 	"ДополнительныеДанныеЖивотных");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Дата последнего отела");
	СтруктураДанных.Вставить("Тип", 					Тип("Дата"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	Возврат МассивПолейЗаполнения;
	
КонецФункции
