
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки(); 

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки,,,);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//Если ДокументРезультат.Рисунки.Количество() = 0 Тогда
	//	ДокументРезультат.ФиксацияСлева = 1;
	//КонецЕсли;  
	
	Для Строка = 1 По 6 Цикл
		Для Колонка = 1 По ДокументРезультат.ШиринаТаблицы Цикл
			Ячейка = ДокументРезультат.Область(Строка,Колонка);
			Если Ячейка.Текст = "Производственная группа" Тогда
				Ячейка.Примечание.Текст = "* - брак";
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры    


