
Функция ОткрытьФормуВыбораЖивотного(ВладелецДокумент, СписокПараметров) Экспорт
	
	ФормаВыбора = ПолучитьФорму("Справочник.Животные.ФормаВыбора", СписокПараметров ,ВладелецДокумент);
	
	ФормаВыбора.Открыть();
	
КонецФункции

Функция ОткрытьФормуЗаполненияОбъектаНаОснованииФайла(ФормаВладелец, Объект, РазделУчета = Неопределено) Экспорт
	
	ФормаЗаполнения = ПолучитьФорму("Обработка.ЗаполнениеДокументовИзФайла.Форма.Форма",, ФормаВладелец);
	ФормаЗаполнения.Объект.ОбъектЗаполнения = Объект;
	ФормаЗаполнения.Объект.РазделУчета		= РазделУчета;
	
	ФормаЗаполнения.Открыть();
	
КонецФункции

	
